export default `### **個人情報の収集·利用に同意(必須)**

1. **会員登録及び顧客管理** 
   - 収集目的:会員登録及び顧客管理、自社サービス会員登録
   - 収集項目:氏名、ID、パスワード、メールアドレス、携帯電話番号
   - 保有及び利用期間: **会員退会時まで**
2. **サービス利用**
   - 収集目的:クレジットカード決済、カカオペイ決済、動画コーディング講義コンテンツ提供、アプリ共有/プレイプラットフォーム運営、教材など学習過程に必要な物品配送、プロフィール設定
   - 収集項目:カード会社、カード番号、氏名、パスワード、メールアドレス、携帯電話番号、住所、生年月日、プロフィール画像、ニックネーム、学校
   - 保有及び利用期間: **会員退会時まで。 ただし、関係法令により保存義務があれば、当該期間の間、保存**
3. **お客様のお問い合わせ**
   - 収集目的:お問い合わせ及び苦情対応
   - 収集項目:氏名、パスワード、メールアドレス、携帯電話番号、その他入力した事項、お問い合わせ内容
   - 保有及び利用期間: **会員退会時まで。 ただし、関係法令により保存義務があれば、当該期間の間、保存**

会員様は同意を拒否する権利があり、同意に拒否する場合、レッドブリックサービスをご利用になれません。
`;
