export default `### **개인정보 수집이용 동의 (필수)**

1. **회원가입 및 고객관리** 
   - 수집목적 : 회원가입 및 고객관리, 자체서비스 회원가입
   - 수집항목 : 이름, 아이디, 비밀번호, 이메일 주소, 휴대폰 번호
   - 보유 및 이용기간 : **회원탈퇴 시 까지**
2. **서비스이용**
   - 수집목적 : 신용카드 결제, 카카오페이 결제, 동영상 코딩 강의 컨텐츠 제공, 앱 공유/플레이 플랫폼 운영, 교재 등 학습과정에 필요한 물품 배송, 프로필 설정
   - 수집항목 : 카드사, 카드번호, 이름, 비밀번호, 이메일 주소, 휴대폰 번호, 주소, 생년월일, 프로필 이미지, 닉네임, 학교
   - 보유 및 이용기간 : **회원탈퇴 시 까지. 단, 관계 법령에 따라 보존의무가 있으면 해당기간 동안 보존**
3. **고객문의**
   - 수집목적 : 문의 및 불만사항 응대
   - 수집항목 : 이름, 비밀번호, 이메일 주소, 휴대폰 번호, 기타 입력한 사항, 문의내용
   - 보유 및 이용기간 : **회원탈퇴 시 까지. 단, 관계 법령에 따라 보존의무가 있으면 해당기간 동안 보존**

회원님은 동의를 거부할 권리가 있으며 동의에 거부할 경우 위즈스쿨 서비스를 이용할 수 없습니다.
`;
