export default `### プライバシーポリシー（必須）
MANGOSTEEMS PTE. LTD （以下「当社」という。）は、お客様の個人情報保護の重要性について認識し、 個人情報の保護に関する法律（以下「個人情報保護法」という。）を遵守すると共に、以下のプライバシーポリシー（以下「本プライバシーポリシー」という。）に従い、適切な取扱い及び保護に努めます。 ユーザーは本サービスを利用することにより、本規約の全ての記載内容について承諾し、同意したものとみなされます。 

1. 会員登録及び顧客管理
- 収集目的: 会員登録及び顧客管理、当社サービス会員登録
- 収集項目: 氏名、ID、パスワード、メールアドレス、電話番号
- 保管及び利用期間: 退会まで


2. サービス利用
- 収集目的: 教材など学習過程に必要なプロフィール設定
- 収集項目: 氏名 、パスワード、Eメールアドレス、 電話番号 、プロフィールイメージ、ニックネーム、機関名
- 保管及び利用期間: 退会まで。 ただし、関係法令により保存義務がある場合、当該期間保存


3. お問合せ
- 収集目的: お問合せ及びクレームの対応
- 収集項目: 氏名 、パスワード、Eメールアドレス、 電話番号 、その他ユーザーから提示される情報、お問合せ内容
- 保管及び利用期間: 退会まで。 ただし、関係法令により保存義務がある場合、当該期間保存

ユーザーは本サービスを利用することにより、本規約の全ての記載内容について承諾し、同意したものとみなされます。


4. プロモーション情報（選択）
- 収集目的: 商品案内、トライアルイベント参加などのマーケティングに活用（プロモーション情報の受信）
- 収集項目: 氏名 、ID、Eメールアドレス、年齢、携帯番号
- 保管及び利用期間: 同意の撤回まで

本プライバシーポリシーに関連するご問い合わせは「acg@mangosteems.com」までお願いいたします。



`;
