export default `### 利用規約

**第 1 条(目的)**
本規約は MANGOSTEEMS PTE. LTD. (以下、「会社」という。)が提供するオンラインソフトウェア教育プラットフォームである Astro Coding Go(以下、「ACG」という。)のサービス及び諸々のサービス利用に関して、会社とユーザー間の権利、義務及び責任事項などを定めることを目的とします。

**第 2 条(定義)**
本規約において使用する用語の定義は次の通りです。

1. 「サービス」とは、会社が提供するプログラミング教育プラットフォームなど、ユーザーに電子的に提供する用役及びオンライン/オフラインサービスを意味します。サービスは ACG が提供する「コンテンツ」を含む概念であり、本規約においては「サービス及びコンテンツ」と表記される場合もあります。
2. 「ユーザー」とは、astro-coding-go.com にアクセスして、本規約に基づいて astro-coding-go.com が提供するサービス及び諸々のサービスを利用する会員及び非会員のことを意味します。
3. 「ID」とは、会員の識別とサービス利用のために、会員が定め会社が承認する文字と数字の組み合わせを意味します。
4. 「パスワード」とは、会員が与えられた ID と一致する会員であることを確認し、秘密保護のために会員本人が定めた文字または数字の組み合わせを意味します。
5. 「投稿」とは、会員がサービスを利用する時、サービス上に掲載した符号・文字・音声・音響・画像・動画などの情報の形をしたテキスト、画像、動画及び各種のファイルやリンクなどを意味します。

**第 3 条(規約の掲示と改訂)**
1. 会社は本規約の内容を会員が簡単に確認できるように、サービスの初期画面から連結画面を通じて見られるようにします。
2. 会社が規約を改訂する場合、適用日時及び改訂理由を明示して現行規約とともに第 1 項の方法に従って、その改訂規約の適用日時の 7 日前から適用日時の前日まで告知します。
3. 会社が前項の規定に基づき改訂規約を告知または通知して、会員が 7 日以内に拒否の意思を表示しない場合、会員はすべての改訂規約に同意したものとみなします。
4. 会員が改訂規約の適用に同意しない場合、会社は改訂規約の内容を適用することができません。この場合、会員は利用契約を解約することができます。ただし、既存の規約を適用できない特別な事情がある場合、会社は利用契約を解約することができます。

**第 4 条(規約の解釈)**
会社はサービスの円滑な提供のために別途の利用ポリシーを作成することができ、本規約で定めていない事項や解釈に関しては利用ポリシー、関係法令または商慣習に従います。

**第 5 条(利用規約の締結)**
1. 利用規約は会員登録をする者(以下、「会員登録申込者」という。)が規約の内容に同意した後、会員登録を申し込み、会社がこの申し込みを承諾することで締結されます。
2. 会社は 会員登録申込者の申し込みに対し、サービス利用を承諾することを原則とします。ただし、会社は次の各号に当たる申し込みに対しては承諾しない、または、後日利用規約を解約することができます。
   1. 会員登録申込者が本規約に基づいて以前会員資格を失ったことがある場合、ただし、会社が再登録を承諾した場合は例外とする。
   2. 虚偽情報を記載するか、会社が提示する内容を記載しない場合
   3. 会員登録申込者の帰責事由によって承認できない、またはその他の規定事項に違反して申し込んだ場合
3. 第 1 項に基づいた申し込みに対して会社は会員の種類によっては専門機関による実名確認及び本人認証を要請することができます。
4. 会社はサービス関連設備に余裕がないか、技術上または業務上の問題が生じた場合は承諾を保留することができます。
5. 第 2 項と第 4 項に基づいて 会員登録の申し込みを承諾しない、または保留した場合、会社は原則として会員登録申込者にこれを知らせます。
6. 利用規約の成立時点は会社が会員登録の完了を申し込み手続き上に表示した時点とします。
7. 会社は会員に対して会社のポリシーに基づいて等級別に区分して利用時間、利用回数、サービスメニューなどを細分化して利用を差別化することができます。

**第 6 条(会員情報の変更)**
1. 会員は個人情報管理画面を通じていつでも本人の個人情報を閲覧、修正することができます。ただし、サービス管理に必要な ID などは修正することができません。
2. 会員は会員登録の申し込み時に記載した事項が変更された場合、オンライン上で修正するか、電子メールなどの方法で会社にその変更事項を知らせます。
3. 第 2 項の変更事項を会社に知らせずに発生した不利益に対して会社は責任を負いません。

**第 7 条(個人情報保護義務)**
会社は関係法令に基づき、会員の個人情報を保護するために努力します。 個人情報の保護及び使用に対しては関係法令及び会社のプライバシーポリシーが適用されます。ただし、会社の公式サイト以外のリンク先のサイトは会社のプライバシーポリシーの適用外です。

**第 8 条(会員の ID 及びパスワード管理に関する義務)**
1. 会員の ID とパスワードの管理責任は会員にあり、これを第 3 者に提供することを禁じます。
2. 会社は会員の ID に個人情報漏洩の可能性や反社会的または風紀を乱す、会社及び会社の運営者と誤認される恐れがある場合、その ID の利用を制限することができます。
3. 会員は ID 及びパスワードが不正利用されていると認知した場合、それを即時に会社に通知し、会社の案内に従います。
4. 第 3 項の場合、その会員が会社にその事実を通知しない、または通知しても会社の案内に従わずに発生した不利益に対して会社は責任を負いません。

**第 9 条(会員への通知)**
会社が会員へ通知する場合、本規約に別に定める規定がない限り、サービス画面、電子メールなどで通知します。

**第 10 条(ユーザーに対する会社の義務)**
1. 会社は法令と本規約で定める権利の行使と義務の履行を信義を旨とし、誠実に行わなければなりません。
   1. 会社はユーザーがコンテンツ及びサービスを利用できるように対応します。
   2. 会社はコンテンツ及びサービス利用に関してユーザーからの意見や苦情が正当だと判断した場合、これを滞りなく処理します。

**第 11 条(「ユーザー」の義務)**
1. ユーザー(会員/非会員)には次の行動を禁じます。
   1. 申し込みまたは変更時に虚偽の内容を記載または他人の情報を不正利用
   2. 会社に掲示された情報の変更
   3. 会社が禁止した情報(PC アプリなど)の送信または掲示
   4. 会社とその他第 3 者の著作権などの知的財産権の侵害
   5. 会社及びその他第 3 者の名誉を毀損または業務を妨害する行為
   6. わいせつまたは暴力的な言動、画像、音響、その他の風紀を乱す情報を会社のサイトに公開または掲示する行為
   7. その他違法または不当な行為
2. ユーザーは関係法令、本規約で定める規定、利用案内及びコンテンツとサービスについて告知した注意事項、会社が通知する事項などを遵守する義務があり、その他の会社の業務を妨げる行為を禁じます。

**第 12 条(サービスの提供など)**
1. 会社は会員に下記のようなサービスを提供します。
   1. プログラミング教育サービス
   2. プログラミング著作プラットフォーム
   3. プログラミング著作物の共有プラットフォーム
   4. その他会社が追加で開発するか、他社との提携契約などで会員に提供する一切のサービス
2. 会社はパソコンなどの情報通信設備の保守点検、交替及び故障、通信途絶または運営上で相当な理由がある場合、サービスの提供を一時的に中断することができます。この場合、会社は会員にその旨を通知します。ただし、会社が事前に通知できないやむを得ない事情がある場合は事後に通知することができます。
3. 会社はサービスの提供に必要な場合、定期メンテナンスを行うことができ、定期メンテナンスの時間はサービス提供画面に通知した内容に従います。
   第 13 条(サービスの変更)
4. 会社は相当な理由がある場合、運営上、技術上の必要によっては提供しているサービスの全体または一部のサービスを変更することができます。
5. サービスの内容、利用方法に変更がある場合、変更されるサービスの内容及び提供日時などは、その変更前に当該サービスのメイン画面に掲示します。
6. 会社は無料で提供されるサービスの一部または全体を会社のポリシー及び運営上の必要によって修正、中断、変更することができ、これについて関連法に特別な規定がない限り、会員に別途賠償を行いません。

**第 14 条(情報の提供及び広告の掲載)**
1. 会社はユーザーがサービス利用中に必要だと認められる様々な情報をお知らせや電子メールなどの方法にて会員に提供することができます。ただし、ユーザーは関連法に基づく取引に関する情報及びお問い合わせなどへの回答などを除くすべての電子メールの受信を拒否することができます。
2. 会社はサービス運営上サービス画面、ホームページ、電子メールなどに広告を掲載することができます。広告が掲載された電子メールを受信したユーザーは会社に受信を拒否することができます。
3. ユーザーは会社が提供するサービスにおいて投稿またはその他の情報を変更、修正、制限するなどの措置を取りません。

**第 15 条(投稿の著作権)**
1. ユーザーがサービス内で作成した投稿の著作権は、その投稿の著作者に帰属されます。
2. ユーザーはご本人が作成した投稿(作品)をサービス内に公開する場合、次の各号の事項を承諾し、具体的な内容は会社の利用ポリシーに従います。
   2.1 自分が作成した投稿(作品)を公開する際、自分が作成した投稿(作品)とそのソースコードの公開に同意します。
   2.2 自分が作成した投稿(作品)を公開する際、他人が自分の投稿(作品)を利用することを許可します。
   2.3 自分が作成した投稿(作品)を公開する際、他人が自分の投稿(作品)を修正することを許可します。(二次的著作物の制作を含む)
3. ユーザーがサービス内で作成する投稿は検索結果ないしサービス及び関連プロモーションなどに表示される場合があり、その表示のために必要な範囲内で一部修正、コピー、編集され掲示される場合があります。この場合、会社は著作権法の規定を遵守し、会員はお客様センター及びサービス内の管理機能を通じてその投稿の削除、非公開などの措置を取ることができます。

**第 16 条(投稿の管理)**
1. ユーザーの投稿に関連法に違反する内容が含まれている場合、権利者は関連法で定める手続きに従ってその投稿の掲示中断及び削除などを要請することができ、会社は関連法に基づいた措置を取らなければなりません。
2. 会社は前項の規定による権利者の要請がない場合でも権利侵害が認められる事由があるか、その他の会社のポリシー及び関連法に違反する場合は、関連法に基づいてその投稿に臨時的な措置などを取ることができます。

**第 17 条(権利の帰属)**
1. サービスに対する著作権及び知的財産権は会社に帰属します。ただし、ユーザーの「投稿及び提携契約に基づいて提供された著作物」などは除外されます。
2. 会社はサービスにおいてユーザーに会社が定める利用条件に従ってアカウント、コンテンツなどを利用できる権利のみを与え、ユーザーはこれを譲渡、販売、担保提供などの処分行為を取ることができません。

**第 18 条(会員の契約解除、解約など)**
1. 会員はいつでもサービスメイン画面のお客様センターまたは MY 情報管理メニューなどから利用契約の解約を申し込むことができます。会社は関連法の定めに従ってこれを即時に処理しなければなりません。
2. 会員が契約を解約する場合、関連法及びプライバシーポリシーに基づいて会社が会員情報を保有する場合を除き、解約した瞬間会員のすべてのデータは削除されます。
3. 会員が契約を解約する場合、会員が作成した投稿の中でプロジェクトなどのようにご本人のアカウントに登録された投稿は一切削除されます。ただし、共用掲示板に登録された投稿、共有などによって再登録された投稿は削除されないため、直接削除するか会社に削除を要請することで事前に削除してから退会してください。
4. 前項に関して会員が著作者ではないか、他人と共同で権利を保有する投稿は削除されない場合があります。

**第 19 条(会員の利用制限など)**
1. 会社は会員が本規約の義務に違反または正常なサービス提供を妨げた場合、警告、アカウントの一時停止、アカウントの永久停止など、サービス利用を段階的に制限することができます。本項に基づいてアカウントが永久停止される場合、サービス利用中に獲得したポイント及びその他の特典もすべて消滅され、会社はこれに対して別途賠償を行いません。
2. 会社は会員が 3 ヶ月以上ログインしない場合、会員情報の保護及び運営効率性のため利用を制限することができます。
3. 会社は本条の利用制限範囲内での制限の条件及び細部内容は利用ポリシーの定めに従います。
4. 本条に基づいてサービス利用を制限または契約を解約する場合、会社は第 9 条[会員への通知]に従って通知します。
5. 会員は本条に基づく利用制限などに対して会社が定める手続きに従って異議を申し立てることができます。この場合、正当な異議だと会社が認めた場合、会社は即時にサービスの利用を再開します。

**第 20 条(未成年者の利用契約に関する特則)**
1. 会社は 18 歳未満の未成年ユーザーの有料サービスの利用にあたって親などの法定代理人からの同意を得るか、契約締結後に追認を得なければ未成年者の本人または法定代理人がその契約を取り消すことができるという内容を契約締結前に告知します。

**第 21 条(免責条項)**
1. 天変地異またはこれに準ずる不可抗力によってコンテンツ及びサービスを提供できない場合、会社はコンテンツ及びサービス提供に関する責任を負いません。
2. 会社はユーザーの帰責事由によるコンテンツ及びサービス利用の障害に対して責任を負いません。
3. 会社はユーザーがコンテンツに関して投稿した情報、資料、事実の信頼度、正確性などの内容に関して責任を負いません。
4. 会社はユーザー間またはユーザーと第 3 者間のコンテンツ及びサービスを媒介にして発生した紛争に対して責任を負いません。
5. 会社は無料で提供されるサービス利用に関して関連法に特別な規定がない限り、責任を負いません。

**第 22 条(個人情報保護)**
1. 会社は情報通信網法などの関係法令に基づき、ユーザーの個人情報を保護するために努力します。 個人情報の保護及び使用には関連法及び会社のプライバシーポリシーが適用されます。

**第 23 条(紛争の解決)**
会社は紛争が発生した場合、ユーザーが提起する正当な意見や不満を反映して適切かつ迅速な対応を取ります。ただし、迅速な処理が困難な場合、会社はユーザーにその理由と処理日程を通知します。

**第 24 条(準拠法及び管轄裁判所)**
1. 会社とユーザー間で提起される訴訟はシンガポール法を準拠法とします。
2. 会社と会員間で発生した紛争に関する訴訟は提訴当時のユーザーの住所を基準とし、住所がない場合、居所を管轄する地方裁判所の専属管轄とします。

**第 25 条(その他の条項)**
1. 会員は相手側の書面による事前の同意なく本規約上の権利と義務を第 3 者に譲渡することはできません。
2. 本規約に関して当事者間の合意によって追加で作成された契約書、協定書、通報書などと会社のポリシー変更、法令の制定・改訂または公共機関の告示・指針などに基づき会社がサービスを通じて会員に告知する内容も本規約の一部を構成します。.

本規約は 2022 年 1 月 1 日から適用されます。

`;
