export default `### **주식회사 위즈스쿨 이용약관**

**제 1 조 (목적)**
이 약관은 주식회사 위즈스쿨에서 제공하는 서비스 및 제반서비스의 이용과 관련하여 위즈스쿨과 이용자와의 권리, 의무 및 책임사항 등을 규정함을 목적으로 합니다.

**제 2 조 (정의)**
이 약관에서 사용하는 용어의 정의는 다음과 같습니다.

“이용자”라 함은 “wizschool.io”의 사이트에 접속하여 이 약관에 따라 “wizschool.io”가 제공하는 "서비스" 및 제반서비스를 이용하는 회원 및 비회원을 말합니다.
“회원"이라 함은 회사의 "서비스"에 접속하여 이 약관에 따라 "회사"와 이용계약을 체결하고 "회사"가 제공하는 "서비스"를 이용하는 고객을 말합니다.
“아이디(id)"이라 함은 "회원"의 식별과 "서비스" 이용을 위하여 "회원"이 정하고 "회사"가 승인하는 문자와 숫자의 조합을 의미합니다. 
“서비스”라 함은 “wizschool.io”가 제공하는 프로그래밍 교육 플랫폼 등 “wizschool.io”가 “이용자”에게 전자적으로 제공하는 용역 및 온라인/오프라인 서비스를 의미합니다. “서비스”는“wizschool.io”가 제공하는 “콘텐츠”를 포함하는 개념이며, 본 계약에서는 “서비스 및 콘텐츠”로 표시하는 경우도 있습니다.
“비밀번호(PASSWORD)”라 함은 "회원"이 부여 받은 "아이디와 일치되는 “회원"임을 확인하고 비밀보호를 위해 "회원” 자신이 정한 문자 또는 숫자의 조합을 의미합니다.
”게시물”이라 함은 "회원”이 "서비스"를 이용함에 있어 "서비스상"에 게시한 부호ㆍ문자ㆍ음성ㆍ음향ㆍ화상ㆍ동영상 등의 정보 형태의 글, 사진, 동영상 및 각종 파일과 링크 등을 의미합니다.

**제 3 조 (약관의 게시와 개정)**
주식회사 위즈스쿨(이하 “회사”)은 이 약관의 내용, 상호, 대표자 성명, 영업소 소재지 주소, 전화번호, 모사전송번호, 전자우편주소, 사업자등록번호, 통신판매업 신고번호 및 개인정보관리책임자 등을 이용자가 쉽게 알 수 있도록 온라인 서비스초기화면에 게시합니다. 다만, 약관은 이용자가 연결화면을 통하여 볼 수 있도록 할 수 있습니다.

”회사”는 이 약관의 내용을 "회원"이 쉽게 알 수 있도록 서비스 초기 화면에 게시합니다.
“회사”는 "약관의규제에관한법률", "정보통신망이용촉진및정보보호등에관한법률(이하 "정보통신망법")" 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
“회사”가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 제1항의 방식에 따라 그 개정약관의 적용일자 30일 전부터 적용일자 전일까지 공지합니다. 다만, 회원에게 불리한 약관의 개정의 경우에는 공지 외에 로그인시 동의창 등의 전자적 수단을 통해 따로 명확히 통지하도록 합니다.
“회사”가 전항에 따라 개정약관을 공지 또는 통지하면서 회원에게 30일 기간 내에 의사표시를 하지 않으면 의사표시가 표명된 것으로 본다는 뜻을 명확하게 공지 또는 통지하였음에도 회원이 명시적으로 거부의 의사표시를 하지 아니한 경우 회원이 개정약관에 동의한 것으로 봅니다.
“회원”이 개정약관의 적용에 동의하지 않는 경우 회사는 개정 약관의 내용을 적용할 수 없으며, 이 경우 회원은 이용계약을 해지할 수 있습니다. 다만, 기존 약관을 적용할 수 없는 특별한 사정이 있는 경우에는 회사는 이용계약을 해지할 수 있습니다.

**제 4 조 (약관의 해석)**
“회사”는 “서비스”의 원활한 제공을 위하여 별도의 이용정책을 둘 수 있으며, 이 약관에서 정하지 아니한 사항이나 해석에 대해서는 이용정책, 관계법령 또는 상관례에 따릅니다.

**제 5 조 (이용계약 체결)**
이용계약은 "회원"이 되고자 하는 자(이하 "가입신청자")가 약관의 내용에 대하여 동의를 한 다음 회원가입신청을 하고 "회사"가 이러한 신청에 대하여 승낙함으로써 체결됩니다.
“회사"는 "가입신청자"의 신청에 대하여 "서비스" 이용을 승낙함을 원칙으로 합니다. 다만, "회사"는 다음 각 호에 해당하는 신청에 대하여는 승낙을 하지 않거나 사후에 이용계약을 해지할 수 있습니다.
가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우, 단 "회사"의 회원 재가입 승낙을 얻은 경우에는 예외로 함.
허위의 정보를 기재하거나, "회사"가 제시하는 내용을 기재하지 않은 경우
”가입신청자”의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우
3. 제1항에 따른 신청에 있어 "회사"는 "회원"의 종류에 따라 전문기관을 통한 실명확인 및 본인인증을 요청할 수 있습니다.
4. "회사"는 서비스관련설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다.
5. 제2항과 제4항에 따라 회원가입신청의 승낙을 하지 아니하거나 유보한 경우, "회사"는 원칙적으로 이를 가입신청자에게 알리도록 합니다.
6. 이용계약의 성립 시기는 "회사"가 가입완료를 신청절차 상에서 표시한 시점으로 합니다.
7. "회사"는 "회원"에 대해 회사정책에 따라 등급별로 구분하여 이용시간, 이용횟수, 서비스 메뉴 등을 세분하여 이용에 차등을 둘 수 있습니다.
8. "회사"는 "회원"에 대하여 "영화 및 비디오물의진흥에관한법률" 및 "청소년보호법"등에 따른 등급 및 연령 준수를 위해 이용제한이나 등급별 제한을 할 수 있습니다.

**제 6 조 (회원정보의 변경)**
”회원"은 개인정보관리화면을 통하여 언제든지 본인의 개인정보를 열람하고 수정할 수 있습니다. 다만, 서비스 관리를 위해 필요한 “아이디” 등은 수정이 불가능합니다.
“회원"은 회원가입신청 시 기재한 사항이 변경되었을 경우 온라인으로 수정을 하거나 전자우편 기타 방법으로 "회사"에 대하여 그 변경사항을 알려야 합니다.
“회원"은 개인정보관리화면을 통하여 언제든지 본인의 개인정보를 열람하고 수정할 수 있습니다. 다만, 서비스 관리를 위해 필요한 “아이디” 등은 수정이 불가능합니다.
제2항의 변경사항을 "회사"에 알리지 않아 발생한 불이익에 대하여 "회사"는 책임지지 않습니다.

**제 7 조 (개인정보보호 의무) **
1. "회사"는 "정보통신망법" 등 관계 법령이 정하는 바에 따라 "회원"의 개인정보를 보호하기 위해 노력합니다. 개인정보의 보호 및 사용에 대해서는 관련법 및 2. "회사"의 개인정보처리방침이 적용됩니다. 다만, "회사"의 공식 사이트 이외의 링크된 사이트에서는 "회사"의 개인정보처리방침이 적용되지 않습니다.

**제 8 조 ("회원"의 "아이디" 및 "비밀번호"의 관리에 대한 의무)**
“회원”의 “아이디”와 “비밀번호”에 관한 관리책임은 “회원”에게 있으며, 이를 제 3자가 이용하도록 하여서는 안 됩니다.
“회사”는 “회원”의 “아이디”가 개인정보 유출 우려가 있거나, 반사회적 또는 미풍양속에 어긋나거나 “회사” 및 “회사”의 운영자로 오인할 우려가 있는 경우, 해당 “아이디”의 이용을 제한할 수 있습니다.
“회원"은 "아이디" 및 "비밀번호"가 도용되거나 제3자가 사용하고 있음을 인지한 경우에는 이를 즉시 "회사"에 통지하고 "회사"의 안내에 따라야 합니다.
제3항의 경우에 해당 "회원"이 "회사"에 그 사실을 통지하지 않거나, 통지한 경우에도 "회사"의 안내에 따르지 않아 발생한 불이익에 대하여 "회사"는 책임지지 않습니다. 

**제 9 조 ("회원"에 대한 통지)**
“회사"가 "회원"에 대한 통지를 하는 경우 이 약관에 별도 규정이 없는 한 서비스 화면, 전자우편주소 등으로 할 수 있습니다.
“회사”는 “회원” 전체에 대해 통지의 경우 7일 이상 “회사”의 공지사항에 게시함으로써 제1항의 통지에 갈음할 수 있습니다. 

**제 10 조 ("회사"의 의무)**
”회사"는 관련법과 이 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로 "서비스"를 제공하기 위하여 최선을 다하여 노력합니다.
"회사"는 "회원"이 안전하게 "서비스"를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보처리방침을 공시하고 준수합니다.
“회사"는 서비스이용과 관련하여 발생하는 ”회원”의 불만 또는 피해구제요청을 적절하게 처리할 수 있도록 필요한 인력 및 시스템을 구비합니다.
”회사"는 서비스이용과 관련하여 "회원"으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하여야 합니다. "회원"이 제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 전자우편 등을 통하여 "회원"에게 처리과정 및 결과를 전달합니다.

**제 11 조 ("회원"의 의무)**
 "회원"은 다음 행위를 하여서는 안 됩니다.
 - 신청 또는 변경 시 허위내용의 등록
 - 타인의 정보도용
 - “회사"가 게시한 정보의 변경
 - “회사"가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시
 - “회사"와 기타 제3자의 저작권 등 지적재산권에 대한 침해
 - “회사" 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
 - 외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 "서비스"에 공개 또는 게시하는 행위
 - 회사의 동의 없이 영리를 목적으로 "서비스"를 사용하는 행위
 - 기타 불법적이거나 부당한 행위
2. “회원"은 관계법, 이 약관의 규정, 이용정책, 이용안내 및 "서비스"와 관련하여 공지한 주의사항, "회사"가 통지하는 사항 등을 준수하여야 하며, 기타 "회사"의 업무에 방해되는 행위를 하여서는 안 됩니다.

**제 12 조 ("서비스"의 제공 등)**
회사는 회원에게 아래와 같은 서비스를 제공합니다.
 - 프로그래밍 교육 서비스
 - 프로그래밍 저작 플랫폼
 - 프로그래밍 저작물 공유 플랫폼
 - 프로그래밍 교육 관련 커뮤니티
 -  기타 "회사"가 추가 개발하거나 다른 회사와의 제휴계약 등을 통해 "회원"에게 제공하는 일체의 서비스
2. 회사는 "서비스"를 일정범위로 분할하여 각 범위 별로 이용가능시간을 별도로 지정할 수 있습니다. 다만, 이러한 경우에는 그 내용을 사전에 공지합니다.
3. “서비스"는 연중무휴, 1일 24시간 제공함을 원칙으로 합니다.
4. “회사"는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상 상당한 이유가 있는 경우 "서비스"의 제공을 일시적으로 중단할 수 있습니다. 이 경우 "회사"는 "회원"에게 통지합니다. 다만, "회사"가 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있습니다.
5. ”회사"는 서비스의 제공에 필요한 경우 정기점검을 실시할 수 있으며, 정기점검시간은 서비스제공화면에 공지한 바에 따릅니다.

**제 13 조 ("서비스"의 변경)**
“회사"는 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라 제공하고 있는 전부 또는 일부 "서비스"를 변경할 수 있습니다.
2. “서비스"의 내용, 이용방법, 이용시간에 대하여 변경이 있는 경우에는 변경사유, 변경될 서비스의 내용 및 제공일자 등은 그 변경 전에 해당 서비스 초기화면에 게시하여야 합니다.
3. “회사"는 무료로 제공되는 서비스의 일부 또는 전부를 회사의 정책 및 운영의 필요상 수정, 중단, 변경할 수 있으며, 이에 대하여 관련법에 특별한 규정이 없는 한 "회원"에게 별도의 보상을 하지 않습니다.

**제 14 조 (정보의 제공 및 광고의 게재)**
”회사"는 "회원"이 "서비스" 이용 중 필요하다고 인정되는 다양한 정보를 공지사항이나 전자우편 등의 방법으로 "회원"에게 제공할 수 있습니다. 다만, "회원"은 관련법에 따른 거래관련 정보 및 고객문의 등에 대한 답변 등을 제외하고는 언제든지 전자우편에 대해서 수신 거절을 할 수 있습니다.
제1항의 정보를 전화 및 모사전송기기에 의하여 전송하려고 하는 경우에는 "회원"의 사전 동의를 받아서 전송합니다. 다만, "회원"의 거래관련 정보 및 고객문의 등에 대한 회신에 있어서는 제외됩니다.
“회사"는 "서비스"의 운영과 관련하여 서비스 화면, 홈페이지, 전자우편 등에 광고를 게재할 수 있습니다. 광고가 게재된 전자우편을 수신한 "회원"은 수신거절을 "회사"에게 할 수 있습니다.
”이용자(회원, 비회원 포함)"는 회사가 제공하는 서비스와 관련하여 게시물 또는 기타 정보를 변경, 수정, 제한하는 등의 조치를 취하지 않습니다.

**제 15 조 ("게시물"의 저작권)**
”회원"이 "서비스" 내에 게시한 "게시물"의 저작권은 해당 게시물의 저작자에게 귀속됩니다.
“회원"은 본인이 작성한 게시물(작품)을 서비스내에 공개할 경우 다음 각 호의 사항을 허락하며, 구체적인 내용은 “회사” 저작권 이용정책에 따릅니다.
 - 내가 만든 게시물(작품) 공개 시, 내가 만든 게시물(작품)과 그 소스코드의 공개를 동의합니다.
 - 내가 만든 게시물(작품) 공개 시, 다른 사람이 나의 게시물(작품)을 이용하는 것을 허락합니다
 - 내가 만든 게시물(작품) 공개 시, 다른 사람이 나의 게시물(작품)을 수정하는 것을 허락합니다.(2차 저작물 제작 포함)
3. "회원"이 "서비스" 내에 게시하는 "게시물"은 검색결과 내지 "서비스" 및 관련 프로모션 등에 노출될 수 있으며, 해당 노출을 위해 필요한 범위 내에서는 일부 수정, 복제, 편집되어 게시될 수 있습니다. 이 경우, 회사는 저작권법 규정을 준수하며, "회원"은 언제든지 고객센터 또는 "서비스" 내 관리기능을 통해 해당 게시물에 대해 삭제, 비공개 등의 조치를 취할 수 있습니다.
4. “회사"는 제2항 이외의 방법으로 "회원"의 "게시물"을 이용하고자 하는 경우에는 전화, 팩스, 전자우편 등을 통해 사전에 "회원"의 동의를 얻어야 합니다.

**제 16 조 ("게시물"의 관리)**
“회원"의 "게시물"이 "정보통신망법" 및 "저작권법"등 관련법에 위반되는 내용을 포함하는 경우, 권리자는 관련법이 정한 절차에 따라 해당 "게시물"의 게시중단 및 삭제 등을 요청할 수 있으며, "회사"는 관련법에 따라 조치를 취하여야 합니다.
”회사"는 전항에 따른 권리자의 요청이 없는 경우라도 권리침해가 인정될 만한 사유가 있거나 기타 회사 정책 및 관련법에 위반되는 경우에는 관련법에 따라 해당 "게시물"에 대해 임시조치 등을 취할 수 있습니다.

**제 17 조 (권리의 귀속)**
“서비스"에 대한 저작권 및 지적재산권은 "회사"에 귀속됩니다. 단, "회원"의 "게시물" 및 제휴계약에 따라 제공된 저작물 등은 제외합니다.
“회사"는 서비스와 관련하여 "회원"에게 "회사"가 정한 이용조건에 따라 계정, 콘텐츠, 등을 이용할 수 있는 이용권만을 부여하며, "회원"은 이를 양도, 판매, 담보제공 등의 처분행위를 할 수 없습니다.

**제 18 조 (포인트)**
"회사"는 서비스의 효율적 이용 및 운영을 위해 사전 공지 후 "포인트"의 일부 또는 전부를 조정할 수 있으며, "포인트"는 회사가 정한 기간에 따라 주기적으로 소멸할 수 있습니다.

**제 19 조 (계약해제, 해지 등)**
”회원"은 언제든지 서비스 초기화면의 고객센터 또는 내 정보 관리 메뉴 등을 통하여 이용계약 해지 신청을 할 수 있으며, "회사"는 관련법 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다.
“회원"이 계약을 해지할 경우, 관련법 및 개인정보취급방침에 따라 "회사"가 회원정보를 보유하는 경우를 제외하고는 해지 즉시 "회원"의 모든 데이터는 소멸됩니다.
“회원"이 계약을 해지하는 경우, "회원"이 작성한 "게시물" 중 프로젝트 등과 같이 본인 계정에 등록된 게시물 일체는 삭제됩니다. 다만, 공용게시판에 등록된 “게시물”, 공유 등이 되어 재게시된 “게시물”은 삭제되지 않으니, 직접 삭제 또는 “회사”에 삭제 요청을 통하여 사전에 삭제 후 탈퇴하시기 바랍니다.
전항과 관련하여 “회원”이 저작자가 아니거나 타인이 공동으로 권리를 보유한 “게시물”의 경우 삭제되지 않을 수 있습니다.

**제 20 조 (이용제한 등)**
“회사"는 "회원"이 이 약관의 의무를 위반하거나 "서비스"의 정상적인 운영을 방해한 경우, 경고, 일시정지, 영구이용정지 등으로 "서비스" 이용을 단계적으로 제한할 수 있습니다.
“회사"는 전항에도 불구하고, 결제도용, "저작권법" 및 "컴퓨터프로그램보호법"을 위반한 불법프로그램의 제공 및 운영방해, "정보통신망법"을 위반한 불법통신 및 해킹, 악성프로그램의 배포, 접속권한 초과행위 등과 같이 관련법을 위반한 경우에는 즉시 영구이용정지를 할 수 있습니다. 본 항에 따른 영구이용정지 시 "서비스" 이용을 통해 획득한 "포인트" 및 기타 혜택 등도 모두 소멸되며, "회사"는 이에 대해 별도로 보상하지 않습니다.
”회사"는 "회원"이 계속해서 3개월 이상 로그인하지 않는 경우, 회원정보의 보호 및 운영의 효율성을 위해 이용을 제한할 수 있습니다.
“회사"는 본 조의 이용제한 범위 내에서 제한의 조건 및 세부내용은 이용정책에서 정하는 바에 의합니다.
본 조에 따라 "서비스" 이용을 제한하거나 계약을 해지하는 경우에는 "회사"는 제9조["회원"에 대한 통지]에 따라 통지합니다.
“회원"은 본 조에 따른 이용제한 등에 대해 "회사"가 정한 절차에 따라 이의신청을 할 수 있습니다. 이 때 이의가 정당하다고 "회사"가 인정하는 경우 "회사"는 즉시 "서비스"의 이용을 재개합니다.

**제 21 조 (책임제한)**
“회사"는 천재지변 또는 이에 준하는 불가항력으로 인하여 "서비스"를 제공할 수 없는 경우에는 "서비스" 제공에 관한 책임이 면제됩니다.
“회사"는 "회원"의 귀책사유로 인한 "서비스" 이용의 장애에 대하여는 책임을 지지 않습니다.
“회사"는 "회원"이 "서비스"와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.
“회사"는 "회원" 간 또는 "회원"과 제3자 상호간에 "서비스"를 매개로 하여 거래 등을 한 경우에는 책임이 면제됩니다.
“회사"는 무료로 제공되는 서비스 이용과 관련하여 관련법에 특별한 규정이 없는 한 책임을 지지 않습니다.

**제 22 조 (준거법 및 재판관할)**
 "회사"와 "회원" 간 제기된 소송은 대한민국법을 준거법으로 합니다.
 "회사"와 "회원"간 발생한 분쟁에 관한 소송은 제소 당시의 "회원"의 주소에 의하고, 주소가 없는 경우 거소를 관할하는 지방법원의 전속관할로 합니다. 단, 제소 당시 "회원"의 주소 또는 거소가 명확하지 아니한 경우의 관할법원은 민사소송법에 따라 정합니다.

**제 24조(이용계약의 성립 등)**
“이용자"는 “회사”가 제공하는 다음 또는 이와 유사한 절차에 의하여 이용신청을 합니다. “회사”는 계약 체결 전에 각 호의 사항에 관하여 "이용자"가 정확하게 이해하고 실수 또는 착오 없이 거래할 수 있도록 정보를 제공합니다.
“콘텐츠" 또는 “서비스” 목록의 열람 및 선택
 전자우편주소 등의 입력
약관내용, 청약철회가 불가능한 "콘텐츠"나 “서비스”에 대해 “회사”가 취한 조치에 관련한 내용에 대한 확인
이 약관에 동의하고 위 제3호의 사항을 확인하거나 거부하는 표시(예, 마우스 클릭)
“콘텐츠" 또는 “서비스”의 이용신청에 관한 확인 또는 “회사”의 확인에 대한 동의 결제방법의 선택
3. “회사”는 "이용자"의 이용신청이 다음 각 호에 해당하는 경우에는 승낙하지 않거나 승낙을 유보할 수 있습니다. 
실명이 아니거나 타인의 명의를 이용한 경우 
허위의 정보를 기재하거나, “회사”가 제시하는 내용을 기재하지 않은 경우

**제 25 조(미성년자 이용계약에 관한 특칙)**
“회사”는 만 20세 미만의 미성년이용자가 유료서비스를 이용하고자 하는 경우에 부모 등 법정 대리인의 동의를 얻거나, 계약체결 후 추인을 얻지 않으면 미성년자 본인 또는 법정대리인이 그 계약을 취소할 수 있다는 내용을 계약체결 전에 고지하는 조치를 취합니다.

**제 26 조(수신확인통지·이용신청 변경 및 취소)**
위즈스쿨은 "이용자"의 이용신청이 있는 경우 "이용자"에게 수신확인통지를 합니다.
수신확인통지를 받은 "이용자"는 의사표시의 불일치 등이 있는 경우에는 수신확인통지를 받은 후 즉시 이용신청 변경 및 취소를 요청할 수 있고, “회사”는 서비스 제공 전에 "이용자"의 요청이 있는 경우에는 지체 없이 그 요청에 따라 처리하여야 합니다.

**제 27 조(위즈스쿨의 의무)**
“회사”는 법령과 이 약관이 정하는 권리의 행사와 의무의 이행을 신의에 좇아 성실하게 하여야 합니다.
“회사”는 "이용자"가 “콘텐츠” 및 “서비스” 이용 및 그 대금내역을 수시로 확인할 수 있도록 조치합니다.
“회사”는 “콘텐츠” 및 “서비스” 이용과 관련하여 "이용자"로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 지체없이 처리합니다. 이용자가 제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 전자우편 등을 통하여 그 처리과정 및 결과를 전달합니다.
“회사”는 이 약관에서 정한 의무 위반으로 인하여 "이용자"가 입은 손해를 배상합니다.

**제 28 조("이용자"의 의무)**
"이용자"는 다음 행위를 하여서는 안 됩니다.
신청 또는 변경 시 허위내용의 기재
타인의 정보도용
“회사”에 게시된 정보의 변경
“회사”가 금지한 정보(컴퓨터 프로그램 등)의 송신 또는 게시
“회사”와 기타 제3자의 저작권 등 지적재산권에 대한 침해
“회사”및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
외설 또는 폭력적인 말이나 글, 화상, 음향, 기타 공서양속에 반하는 정보를 “회사”의 사이트에 공개 또는 게시하는 행위
기타 불법적이거나 부당한 행위
9. ”이용자"는 관계법령, 이 약관의 규정, 이용안내 및 "콘텐츠"와 “서비스”와 관련하여 공지한 주의사항, “회사”가 통지하는 사항 등을 준수하여야 하며, 기타 “회사”의 업무에 방해되는 행위를 하여서는 안 됩니다.

**제 29 조(지급방법)**
“콘텐츠" 및 “서비스”의 이용에 대한 대금지급방법은 다음 각 호의 방법 중 가능한 방법으로 할 수 있습니다. 다만, “회사”는 "이용자"의 지급방법에 대하여 어떠한 명목의 수수료도 추가하여 징수하지 않습니다.
폰뱅킹, 인터넷뱅킹, 메일 뱅킹 등의 각종 계좌이체
선불카드, 직불카드, 신용카드 등의 각종 카드결제
마일리지 등 위즈스쿨이 지급한 포인트에 의한 결제
위즈스쿨과 계약을 맺었거나 위즈스쿨이 인정한 상품권에 의한 결제
전화 또는 휴대전화를 이용한 결제
기타 전자적 지급방법에 의한 대금지급 등

**제 30조(유료 콘텐츠 및 유료 서비스의 제공 및 중단)**
유료 콘텐츠 및 유료 서비스는 연중무휴, 1일 24시간 제공함을 원칙으로 합니다.
“회사”는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상 이유가 있는 경우 유료 콘텐츠 또는 유료 서비스의 제공을 일시적으로 중단할 수 있습니다. 이 경우 “회사”는 제9조["회원"에 대한 통지]에 정한 방법으로 "이용자"에게 통지합니다. 다만, “회사”가 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있습니다.
“회사”는 상당한 이유 없이 유료 콘텐츠 또는 유료 서비스의 제공이 일시적으로 중단됨으로 인하여 "이용자"가 입은 손해에 대하여 배상합니다. 다만, “회사”가 고의 또는 과실이 없음을 입증하는 경우에는 그러하지 아니합니다.
“회사”는 유료 콘텐츠 또는 유료 서비스의 제공에 필요한 경우 정기점검을 실시할 수 있으며, 정기점검시간은 서비스제공화면에 공지한 바에 따릅니다.
사업종목의 전환, 사업의 포기, 업체 간의 통합 등의 이유로 유료 콘텐츠 또는 유료 서비스를 제공할 수 없게 되는 경우에는“회사”는 제9조["회원"에 대한 통지]에 정한 방법으로 "이용자"에게 통지하고 당초 “회사”에서 제시한 조건에 따라 "이용자"에게 보상합니다. 다만, “회사”가 보상기준 등을 고지하지 아니하거나, 고지한 보상기준이 적절하지 않은 경우에는 "이용자"들의 마일리지 또는 적립금 등을 현물 또는 현금으로 "이용자"에게 지급합니다.

**제 31조(유료 콘텐츠 및 유료 서비스의 변경)**
“회사”는 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라 제공하고 있는 콘텐츠와 서비스를 변경할 수 있습니다.
“회사”는 유료 콘텐츠 및 유료 서비스의 내용, 이용방법, 이용시간을 변경할 경우에 변경사유, 변경될 콘텐츠서비스의 내용 및 제공일자 등을 그 변경 전 7일 이상 해당 콘텐츠초기화면에 게시합니다.
제2항의 경우에 변경된 내용이 중대하거나 "이용자"에게 불리한 경우에는 “회사”가 해당 유료 콘텐츠 및 유료 서비스를 제공받는 "이용자"에게 제9조["회원"에 대한 통지]에 정한 방법으로 통지하고 동의를 받습니다. 이때, “회사”는 동의를 거절한 "이용자"에 대하여는 변경전 콘텐츠 또는 서비스를 제공합니다. 다만, 그러한 콘텐츠 또는 서비스 제공이 불가능할 경우 유료 서비스 제공 계약을 해지할 수 있습니다.
“회사”는 유료 콘텐츠 또는 유료 서비스에 대한 제1항에 의한 유료 콘텐츠 및 유료 서비스의 변경에 대한 제3항에 의한 계약의 해지로 인하여 "이용자"가 입은 손해를 배상합니다.

**제 32조(정보의 제공 및 광고의 게재)**
“회사”는 "이용자"가 콘텐츠 또는 서비스 이용 중 필요하다고 인정되는 다양한 정보를 공지사항이나 전자우편 등의 방법으로 "회원"에게 제공할 수 있습니다. 다만, "회원"은 언제든지 전자우편 등을 통하여 수신 거절을 할 수 있습니다.
제1항의 정보를 전화 및 모사전송기기에 의하여 전송하려고 하는 경우에는 "회원"의 사전 동의를 받아서 전송합니다.
“회사”는 "콘텐츠"서비스 제공과 관련하여 콘텐츠 또는 서비스 화면, 홈페이지, 전자우편 등에 광고를 게재할 수 있습니다. 광고가 게재된 전자우편 등을 수신한 "회원"은 수신거절을 “회사”에게 할 수 있습니다.

**제 33조(게시물의 삭제)**
“회사”는 게시판에 정보통신망이용촉진 및 정보보호 등에 관한 법률을 위반한 청소년유해매체물이 게시되어 있는 경우에는 이를 지체 없이 삭제 합니다. 다만, 19세 이상의 "이용자"만 이용할 수 있는 게시판은 예외로 합니다.
“회사”가 운영하는 게시판 등에 게시된 정보로 인하여 법률상 이익이 침해된 자는 “회사”에게 당해 정보의 삭제 또는 반박내용의 게재를 요청할 수 있습니다. 이 경우 “회사”는 지체 없이 필요한 조치를 취하고 이를 즉시 신청인에게 통지합니다.

**제 34조(저작권 등의 귀속)**
“회사”가 작성한 저작물, 특히 “회사”가 제공하는 “콘텐츠”와 “서비스” 에 대한 저작권 기타 지적재산권은 "“회사”에 귀속합니다.
“회사”가 제공하는 서비스 중 제휴계약에 의해 제공되는 저작물에 대한 저작권 기타 지적재산권은 해당 제공업체에 귀속합니다.
”이용자"는 “회사”가 제공하는 서비스를 이용함으로써 얻은 정보나 저작물 중“회사” 또는 제공업체에 지적재산권이 귀속된 정보나 저작물을 “회사” 또는 제공업체의 사전승낙 없이 복제, 전송, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안 됩니다. “이용자”는 “회사”가 제공하는 유료 및 무료 콘텐츠를 “이용자”와 “회사”와의 이용계약의 목적에 부합하는 범위 내에서만 이용 가능합니다.
“회사”는 약정에 따라 "이용자"의 저작물을 사용하는 경우 당해 "이용자"의 허락을 받습니다.

**제 35조(개인정보보호)**
“회사”는 "정보통신망법" 등 관계 법령이 정하는 바에 따라 "이용자"의 개인정보를 보호하기 위해 노력합니다. 개인정보의 보호 및 사용에 대해서는 관련법 및“회사”의 개인정보취급방침이 적용됩니다.

**제 36조조의1(청약철회)**
“회사”의 유료 콘텐츠 및 유료 서비스는 청약철회가 가능한 상품과 청약철회가 제한되는 상품으로 구분되어 제공되며, 이러한 내용은 “이용자”가 유료 콘텐츠 및 유료 서비스를 구매할 시 거래 화면에 고지합니다. “회사”와 청약철회가 가능한 유료 콘텐츠 및 유료 서비스 이용에 관한 계약을 체결한 “이용자”는 구매일 또는 유료 콘텐츠 및 유료 서비스 이용가능일로부터 7일 이내에는 청약의 철회를 할 수 있습니다.
“이용자”는 다음 각 호의 어느 하나에 해당하는 경우에는 회사의 의사에 반하여 제1항에 따른 청약철회 등을 할 수 없습니다. 다만, 회사가 제3항에 따른 조치를 하지 아니하는 경우에는 제2호부터 제5호까지의 규정에 해당하는 경우에도 청약철회 등을 할 수 있습니다.
“이용자”에게 책임이 있는 사유로 재화 등이 멸실되거나 훼손된 경우
“이용자”이 재화를 사용 또는 일부 소비한 경우
시간이 지나 다시 판매하기 곤란할 경우
복제 가능한 재화 등의 포장을 훼손한 경우
용역 또는 「문화산업진흥 기본법」 제2조제5호의 디지털콘텐츠의 제공이 개시된 경우(다만, 가분적 용역 또는 가분적 디지털콘텐츠로 구성된 계약의 경우에는 제공이 개시되지 아니한 부분에 대하여는 그러하지 아니하다)
그 밖에 거래의 안전을 위하여 대통령령으로 정하는 경우
“회사”는 제1항, 제2항 제2호부터 제5호까지 규정에 따라 청약철회 등이 불가능한 재화 등의 경우에는 그 사실을 재화 등의 포장이나 그밖에 “이용자”가 쉽게 알 수 있는 곳에 명확하게 적시하거나 시험 사용 상품을 제공하는 등의 방법으로 청약철회 등의 권리 행사가 방해받지 아니하도록 조치하여야 합니다. 다만, 제2항 제5호 중 디지털콘텐츠에 대하여 “이용자”가 청약철회등을 할 수 없는 경우에는 청약철회등이 불가능하다는 사실의 표시와 함께 대통령령으로 정하는 바에 따라 시험 사용 상품을 제공하는 등의 방법으로 청약철회등의 권리 행사가 방해받지 아니하도록 하여야 합니다. 만약 “회사”가 이러한 조치를 하지 아니한 경우에는 제2항 제2호 내지 제5호의 청약철회 제한사유에도 불구하고 “이용자”은 청약철회를 할 수 있습니다.
“이용자”는 제1항 내지 제3항의 규정에도 불구하고 유료 콘텐츠 및 유료 서비스의 내용이 표시·광고 내용과 다르거나 계약내용과 다르게 이행된 경우에는 구매일 또는 유료 콘텐츠 및 유료 서비스 이용 가능일로부터 3월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 청약철회를 할 수 있습니다.
“이용자”는 구두 또는 서면(전자문서 포함), 전자우편으로 청약철회를 할 수 있습니다.

**제 36조의2(“회사”의 귀책으로 인한 유료 콘텐츠 이용계약의 청약철회)**
“이용자"는 다음 각 호의 사유가 있을 때에는 당해 "콘텐츠"를 공급받은 날로부터 3월 이내 또는 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 콘텐츠이용계약을 해제·해지할 수 있습니다.
이용계약에서 약정한 "콘텐츠"가 제공되지 않는 경우
제공되는 "콘텐츠"가 표시·광고 등과 상이하거나 현저한 차이가 있는 경우
기타 "콘텐츠"의 결함으로 정상적인 이용이 현저히 불가능한 경우
“이용자”는 구두 또는 서면(전자문서 포함), 전자우편으로 청약철회를 할 수 있습니다.
“회사”는 제3항에 따라 "이용자"가 표시한 청약철회 또는 계약해제·해지의 의사표시를 수신한 후 지체 없이 이러한 사실을 "이용자"에게 회신합니다.
“이용자"는 제2항의 사유로 계약해제·해지의 의사표시를 하기 전에 상당한 기간을 정하여 완전한 "콘텐츠" 혹은 서비스이용의 하자에 대한 치유를 요구할 수 있습니다.

**제 37조("이용자"의 청약철회와 계약해제·해지의 효과)**
1. “회사”는 "이용자"가 청약철회의 의사표시를 한 날로부터 또는 "이용자"에게 계약해제·해지의 의사표시에 대하여 회신한 날로부터 3영업일 이내에 대금의 결제와 동일한 방법으로 이를 환급하여야 하며, 동일한 방법으로 환불이 불가능할 때에는 이를 사전에 고지하여야 합니다. 이 경우 “회사”가 "이용자"에게 환급을 지연한 때에는 그 지연기간에 대하여 공정거래위원회가 정하여 고시하는 지연이자율을 곱하여 산정한 지연이자를 지급합니다.
2. “회사”가 제1항에 따라 환급할 경우에 "이용자"가 유료 콘텐츠 및 유료 서비스 이용으로부터 얻은 이익에 해당하는 금액을 공제하고 환급할 수 있습니다.
3. “회사”는 위 대금을 환급함에 있어서 "이용자"가 신용카드 또는 전자화폐 등의 결제수단으로 재화 등의 대금을 지급한 때에는 지체 없이 당해 결제수단을 제공한 사업자로 하여금 재화 등의 대금의 청구를 정지 또는 취소하도록 요청합니다. 다만, 제2항의 금액공제가 필요한 경우에는 그러하지 아니할 수 있습니다.
4. “회사”, "콘텐츠 등의 대금을 지급 받은 자" 또는 "이용자와 콘텐츠이용계약을 체결한 자"가 동일인이 아닌 경우에 각자는 청약철회 또는 계약해제·해지로 인한 대금환급과 관련한 의무의 이행에 있어서 연대하여 책임을 집니다.
5. “회사”는 "이용자"에게 본 약관과 관련 법령에서 허용하는 청약철회를 이유로 위약금 또는 손해배상을 청구하지 않습니다. 그러나 "이용자"의 계약해제·해지는 손해배상의 청구에 영향을 미치지 않습니다.

**제 38조(과오금)**
1. “회사”는 과오금이 발생한 경우 이용대금의 결제와 동일한 방법으로 과오금 전액을 환불하여야 합니다. 다만, 동일한 방법으로 환불이 불가능할 때는 이를 사전에 고지합니다.
2. “회사”의 책임 있는 사유로 과오금이 발생한 경우 “회사”는 계약비용, 수수료 등에 관계없이 과오금 전액을 환불합니다. 다만, "이용자"의 책임 있는 사유로 과오금이 발생한 경우, “회사”가 과오금을 환불하는 데 소요되는 비용은 합리적인 범위 내에서 "이용자"가 부담하여야 합니다.
3. “회사”는 "이용자"가 주장하는 과오금에 대해 환불을 거부할 경우에 정당하게 이용대금이 부과되었음을 입증할 책임을 집니다.
4. “회사”는 과오금의 환불절차를 디지털콘텐츠이용자보호지침에 따라 처리합니다.

**제 39조(콘텐츠하자 등에 의한 이용자피해보상)**
“회사”는 콘텐츠하자 등에 의한 이용자피해보상의 기준·범위·방법 및 절차에 관한 사항을 디지털콘텐츠이용자보호지침에 따라 처리합니다.

**제 40조(면책조항)**
1. “회사”는 천재지변 또는 이에 준하는 불가항력으로 인하여 "콘텐츠"와 “서비스”를 제공할 수 없는 경우에는 "콘텐츠"와 “서비스” 제공에 관한 책임이 면제됩니다.
2. “회사”는 "이용자"의 귀책사유로 인한 "콘텐츠"와 “서비스” 이용의 장애에 대하여는 책임을 지지 않습니다.
3. “회사”는 "회원"이 "콘텐츠"와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.
4. “회사”는 "이용자" 상호간 또는 "이용자"와 제3자 간에 "콘텐츠"와 “서비스”를 매개로 하여 발생한 분쟁 등에 대하여 책임을 지지 않습니다.

**제 41조(분쟁의 해결)**
1. “회사”는 분쟁이 발생하였을 경우에 "이용자"가 제기하는 정당한 의견이나 불만을 반영하여 적절하고 신속한 조치를 취합니다. 다만, 신속한 처리가 곤란한 경우에 “회사”는 "이용자"에게 그 사유와 처리일정을 통보합니다.

**제 42조(준거법 및 관할법원)**
1. “회사”와 “이용자” 간 제기된 소송은 대한민국법을 준거법으로 합니다.
2. “회사”와 “이용자”간 발생한 분쟁에 관한 소송은 제소 당시의 “이용자”의 주소에 의하고, 주소가 없는 경우 거소를 관할하는 지방법원의 전속관할로 합니다. 단, 제소 당시 “이용자”의 주소 또는 거소가 명확하지 아니한 경우의 관할법원은 민사소송법에 따라 정합니다.
3. 해외에 주소나 거소가 있는 “이용자”의 경우 “회사”와 “이용자”간 발생한 분쟁에 관한 소송은 전항에도 불구하고 대한민국 서울중앙지방법원을 관할법원으로 합니다.

**제 43조(기타조항)**
1. 회원은 상대방의 사전 서면 동의 없이 이 약관상의 권리와 의무를 제3자에게 양도 할 수 없습니다.
2. 이 약관과 관련하여 당사자 간의 합의에 의하여 추가로 작성된 계약서, 협정서, 통보서 등과 회사의 정책변경, 법령의 제정·개정 또는 공공기관의 고시·지침 등에 의하여 회사가 서비스를 통해 회원에게 공지하는 내용도 본 약관의 일부를 구성합니다.

이 약관은 2019년 1월 1일부터 적용됩니다.
주식회사 레드브릭
`;
