export default `### **mangoSTEEMS利用約款**

**第 1 条(目的)**

本約款は株式会社mangoSTEEMSが提供するサービス及び諸サービスの利用に関連し、mangoSTEEMSと利用者との権利、義務及び責任事項などを規定することを目的とします。

**第 2 条(定義)**

本約款において使用される用語の定義は、以下の通りです。 「利用者」とは、「astro-coding-go.com」のサイトにアクセスし、本約款に基づき「astro-coding-go.com」が提供する「サービス」及び諸サービスを利用する会員及び非会員をいいます。 「会員」とは、会社の「サービス」にアクセスし、本約款に基づき「会社」と利用契約を締結し、「会社」が提供する「サービス」を利用する顧客のことをいいます。 「ID(id)」とは、「会員」の識別と「サービス」の利用のために、「会員」が定め、「会社」が承認する文字と数字の組み合わせを意味します。 「サービス」とは、「astro-coding-go.com」が提供するプログラミング教育プラットフォームなど、「astro-coding-go.com」が「利用者」に電子的に提供するサービスおよびオンライン/オフラインサービスを意味します。 「サービス」は「astro-coding-go.com」が提供する「コンテンツ」を含む概念であり、本契約では「サービス及びコンテンツ」と表示する場合もあります。 「パスワード(PASSWORD)」とは、「会員」が付与された「IDと一致する」会員」であることを確認し、秘密保護のため「会員」自身が定めた文字または数字の組み合わせを意味します。 「掲示物」とは、「会員」が「サービス」を利用するにあたり、「サービス上」に掲示した符号·文字·音声·音響·画像·動画等の情報形態の文章、写真、動画および各種ファイルとリンク等を意味します。

**第 3 条（約款の掲示と改訂）**

株式会社mangoSTEEMS（以下、「会社」という。）は、本約款の内容、商号、代表者氏名、営業所所在地の住所、電話番号、模写転送番号、電子メールアドレス、事業者登録番号、通信販売業申告番号及び個人情報管理責任者等を利用者が容易に分かるように、オンラインサービスの初期画面に掲示します。 ただし、約款は利用者が接続画面を通じて見ることができるようになります。 「会社」は、本約款の内容を「会員」が容易に知ることができるよう、サービスの初期画面に掲示します。 「会社」は「約款の規制に関する法律」、「情報通信網の利用促進及び情報保護等に関する法律(以下、「情報通信網法」という。)等の関連法に違反しない限り、本約款を改定することができます。 「会社」が約款を改訂する場合、適用日及び改訂事由を明示し、現行約款とともに第1項の方式に基づき、その改訂約款の適用日の30日前から適用日の前日までお知らせします。 ただし、会員に不利な約款の改定の場合は、お知らせ以外にログインする際に同意ウィンドウ等の電磁的手段を通じて別途明確に通知するものとします。 「会社」が前項の規定により改正約款を告知又は通知し、会員に対し、30日の期間内に意思表示をしなければ意思表示が表明されたものとみなすという意味を明確に告知又は通知したにもかかわらず、会員が明示的に拒否の意思表示をしなかった場合、会員が改正約款に同意したものとみなします。 「会員」が改定約款の適用に同意しない場合、会社は改定約款の内容を適用できず、この場合、会員は利用契約を解約することができます。 ただし、既存の約款を適用することができない特別な事情がある場合、会社は利用契約を解約することができます。

**第 4 条(約款の解釈)**

「会社」は"サービス"の円滑な提供のため、別途の利用ポリシーを設けることができ、本約款において定めていない事項や解釈については利用ポリシー、関係法令又は商慣習に従います。

**第 5 条（利用契約締結）**

利用契約は、「会員」になろうとする者（以下、「登録申請者」という。）が約款の内容について同意をした上で会員登録申請を行い 「会社」がこのような申込を承諾することにより締結されます。 「会社」は「登録申込者」の申込に対し、「サービス」の利用を承諾することを原則とします。 ただし、「会社」は次の各号に該当する申請に対しては、承諾をしないか、または事後に利用契約を解約することができます。 登録申請者が本約款に基づき、以前に会員資格を喪失したことがある場合、ただし「会社」の会員再加入の承諾を得た場合は、この限りではない。 虚偽の情報を記載したり、 「会社」が提示する内容を記載しない場合、「登録申請者」の責に帰すべき事由により承認が不可能であり、その他規定した諸事項に違反して申請する場合、 3. 第1項による申請において、「会社」は「会員」の種類により、専門機関による実名確認及び本人認証を要請することができます。 4. "会社"はサービス関連設備の余裕がなく、技術上又は業務上問題がある場合には承諾を留保することができます。 5. 第2項及び第4項に基づき、会員登録申請の承諾をせず、又は留保した場合、「会社」は原則的にこれを登録申請者に通知します。 6. 利用契約の成立時期は、"会社"が登録完了を申込手続き上で表示した時点とします。 7. 「会社」は、「会員」に対して、会社のポリシーに基づいてランク別に区分し、利用時間、利用回数、サービスメニュー等を細分化し、利用に差をつけることができます。 8. 「会社」は、「会員」について、「映画及びビデオ物の振興に関する法律」及び「青少年保護法」等に基づく等級及び年齢遵守のため、利用制限や等級別制限をすることがあります。

**第 6 条（会員情報の変更）**

「会員」は、個人情報管理画面を通じて、いつでも本人の個人情報を閲覧·修正することができます。 ただし、サービスの管理のために必要な「ID」などは修正できません。 「会員」は、会員登録申請時に記載した事項に変更があった場合、オンライン上で修正し、又は電子メールその他の方法により「会社」に対し、その変更事項を通知しなければなりません。 「会員」は、個人情報管理画面を通じて、いつでも本人の個人情報を閲覧·修正することができます。 ただし、サービスの管理のために必要な「ID」などは修正できません。 第2項の変更事項を「会社」に通知しなかったため発生した不利益について、「会社」は責任を負いません。

**第 7 条 (個人情報保護義務)**

「会社」は「情報通信網法」等の関係法令の定めるところにより、「会員」の個人情報を保護することに努めます。 個人情報の保護及び使用については、関連法及び2."会社"の個人情報処理方針が適用されます。 ただし、「会社」の公式サイト以外のリンクされたサイトでは、「会社」の個人情報処理方針が適用されません。

**第 8 条(「会員」の「ID」及び「パスワード」の管理に関する義務)**

「会員」の「ID」と「パスワード」に関する管理責任は「会員」にあり、これを第三者が利用するようにしてはなりません。 「会社」は、「会員」の「ID」が個人情報流出の恐れがあり、または反社会的又は公序良俗に反し、「会社」及び「会社」の運営者と誤認されるおそれがある場合、当該「ID」の利用を制限することがあります。 「会員」は、「ID」及び「パスワード」が盗用されたり、第三者が使用していることを認知した場合は、これを直ちに「会社」に通知し、「会社」の案内に従わなければなりません。 第3項の場合、当該「会員」が「会社」にその事実を通知しなかったり、通知した場合であっても「会社」の案内に従わなかったことにより発生した不利益について、「会社」は責任を負いません。

**第 9 条(「会員」に対する通知)**

「会社」が「会員」に対する通知をする場合、本約款に別途規定がない限り、サービス画面、メールアドレス等とすることができます。 「会社」は、「会員」全体について通知の場合、7日以上「会社」のお知らせに掲示することにより、第1項の通知に代えることができます。

**第 10 条(「会社」の義務)**

「会社」は関連法及びこの約款が禁止されたり、公序良俗に反する行為をせず、継続的かつ安定的に「サービス」を提供するために最善を尽くして努力します。 「会社」は、「会員」が安全に「サービス」を利用できるよう、個人情報(信用情報を含む)保護のためにセキュリティシステムを備え、個人情報処理方針を公示し、遵守します。 「会社」は、サービスの利用に関して発生する「会員」の苦情又は被害救済要請を適切に処理できるよう、必要な人材及びシステムを具備します。 「会社」は、サービス利用に関して「会員」から提起された意見や不満が正当だと認めた場合、これを処理しなければなりません。 「会員」が提起した意見や不満事項については、掲示板を活用し、又はメールにより「会員」に処理過程及び結果を伝達します。

**第 11 条(「会員」の義務)**

「会員」は、次の行為をしてはなりません。 申請または変更時に虚偽内容の登録 他人の情報利用 「会社」が掲示した情報の変更 「会社」が定めた情報以外の情報(コンピュータプログラムなど)等の送信または掲示 「会社」とその他の第三者による著作権等の知的財産権に対する侵害 「会社」その他第三者の名誉を傷つけ、または業務を妨害する行為 わいせつまたは暴力的なメッセージ、画像、音声、その他の公序良俗に反する情報を「サービス」に公開または掲示する行為 会社の同意なく営利目的で"サービス"を使用する行為 その他不法または不当な行為 「会員」は、関係法、本約款の規定、利用案内および「サービス」に関するお知らせの注意事項、「会社」が通知する事項等を遵守しなければならず、その他「会社」の業務を妨害する行為をしてはなりません。

**第 12 条（「サービス」の提供等）**

会社は、会員に対し、以下のようなサービスを提供します。 プログラミング教育サービス プログラミング著作プラットフォーム プログラミング著作物共有プラットフォーム プログラミング教育に関するコミュニティ その他「会社」が追加開発したり、他社との提携契約等を通じて「会員」に提供する一切のサービス 会社は、「サービス」を一定の範囲に分割し、各範囲別に利用可能時間を別途指定することができます。 ただし、このような場合は、その内容を事前にお知らせいたします。 「サービス」は年中無休、1日24時間提供することを原則とします。 「会社」は、コンピュータ等の情報通信設備の保守点検、交換及び故障、通信途絶、又は運営上相当の理由がある場合、「サービス」の提供を一時的に中断することができます。 この場合、「会社」は「会員」に通知します。 ただし、「会社」が事前に通知することができないやむを得ない事由がある場合、事後に通知することができます。 「会社」は、サービスの提供に必要な場合は定期点検を行うことができ、定期点検時間はサービス提供画面にお知らせしたところに従います。

**第 13 条(「サービス」の変更)**

「会社」は、相当の理由がある場合、運営上·技術上の必要により提供している全部又は一部の「サービス」を変更することができます。 2. "サービス"の内容、利用方法、利用時間に対して変更がある場合には、変更事由、変更されるサービスの内容及び提供日等は、その変更前に当該サービスの初期画面に掲示しなければなりません。 3. 「会社」は、無料で提供されているサービスの一部又は全部を会社のポリシー及び運営の必要上、修正、中断、変更することができ、これについて関連法に特別な規定がない限り、「会員」に別途の補償をいたしません。

**第 14 条(情報の提供及び広告の掲載)**

「会社」は、「会員」が「サービス」利用中に必要と認められる様々な情報をお知らせや電子メール等の方法により「会員」に対して提供することができます。 ただし、「会員」は関連法に基づく取引関連情報及び顧客の問い合わせ等に対する回答等を除いては、いつでも電子メールに対して受信拒否をすることができます。 第1項の情報を電話及び模写送信機により送信しようとする場合は、「会員」の事前同意を得て送信します。 ただし、「会員」の取引関連情報及び顧客からのお問い合わせ等に対する回答においては除かれます。 「会社」は「サービス」の運営に関し、サービス画面、ホームページ、メール等に広告を掲載できます。 広告が掲載された電子メールを受信した「会員」は、受信拒否を「会社」にすることができます。 「利用者(会員、非会員を含む)」は、会社が提供するサービスに関して、掲示物またはその他の情報を変更、修正、制限する等の措置を取りません。

**第 15 条(「掲示物」の著作権)**

「会員」が「サービス」内に掲示した「掲示物」の著作権は、当該掲示物の著作者に帰属します。 「会員」は、本人が作成した掲示物(作品)をサービス内に公開する場合、次の各号に掲げる事項を許諾し、具体的な内容は、「会社」著作権利用ポリシーに従います。 自分が作った掲示物(作品)を公開する際は、自分が作った掲示物(作品)とそのソースコードの公開に同意します 自分が作った掲示物(作品)を公開する際は、他の人が私の掲示物(作品)の利用を許可します。 自分が作った掲示物(作品)を公開する際、他の人が自分の掲示物(作品)を修正することを許可します。(2次著作物の制作を含む) 「会員」が「サービス」内に掲示する「掲示物」は、検索結果または「サービス」及び関連プロモーション等に露出されることがあり、当該露出のために必要な範囲内においては、一部の修正、複製、編集されて掲示されることがあります。 この場合、会社は著作権法の規定を遵守し、「会員」はいつでもカスタマーセンター又は「サービス」内の管理機能を通じて当該掲示物について削除、非公開等の措置を取ることができます。 「会社」は、第2項以外の方法で「会員」の「掲示物」を利用する場合は、電話、ファックス、メールなどで事前に「会員」の同意を得なければなりません。

**第 16 条(「掲示物」の管理)**

「会員」の「掲示物」が「情報通信網法」及び「著作権法」等の関連法に違反する内容を含む場合、権利者は関連法が定めた手続きに従い、当該「掲示物」の掲示中断及び削除等を要請することができ、「会社」は関連法に基づき措置を取らなければなりません。 「会社」は前項の規定による権利者の要請がない場合であっても、権利侵害が認められる事由があったり、その他会社の政策及び関連法に違反する場合は、関連法に基づき、当該「掲示物」について臨時措置等を取ることができます。

**第 17 条(権利の帰属)**

「サービス」に関する著作権及び知的財産権は「会社」に帰属します。 ただし、「会員」の「掲示物」及び提携契約に基づいて提供された著作物等は除きます。 「会社」は、サービスに関連し、「会員」に「会社」が定めた利用条件に従ってアカウント、コンテンツ等を利用できる利用権のみを付与し、「会員」はこれを譲渡、販売、担保提供等の処分行為をすることはできません。

**第 18 条(ポイント)**

「会社」は、サービスの効率的利用及び運営のための事前お知らせの上、「ポイント」の一部又は全部を調整することができ、「ポイント」は会社が定めた期間によって周期的に消滅することがあります。

**第 19 条(契約解除、解約等)**

「会員」は、いつでもサービス初期画面のカスタマーセンター又はマイ情報管理メニュー等を通じて利用契約解約申請をすることができ、「会社」は関連法等の定めるところにより、これを直ちに処理しなければなりません。 「会員」が契約を解約する場合、関連法及び個人情報取扱方針に従い、「会社」が会員情報を保有する場合を除き、解約後直ちに「会員」のすべてのデータは消滅します。 「会員」が契約を解約する場合、「会員」が作成した「掲示物」のうち、プロジェクト等のように本人のアカウントに登録された掲示物全ては削除されます。ただし、共用掲示板に登録された「掲示物」、共有等により再掲示された「掲示物」は削除されませんので、直接削除または「会社」に削除要請を通じて事前に削除し、退会してください。 前項と関連し、「会員」が著作者でなく、または他人が共同で権利を有する「掲示物」の場合、削除されないことがあります。

**第 20 条(利用制限等)**

「会社」は、「会員」が本約款の義務に違反し、または「サービス」の正常な運営を妨害した場合、警告、一時停止、永久利用停止等により「サービス」の利用を段階的に制限することができます。 「会社」は、前項にもかかわらず、決済盗用、「著作権法」及び「コンピュータプログラム保護法」に違反した不法プログラムの提供及び運営妨害、「情報通信網法」に違反した不法通信及びハッキング、悪性プログラムの配布、アクセス権限超過行為等の関連法に違反した場合、直ちに永久利用停止を下すことができます。 本項による永久利用停止時、「サービス」利用によって獲得した「ポイント」及びその他の特典等もすべて消滅し、「会社」はこれに対して別途補償しません。 「会社」は、「会員」が続けて3か月以上ログインしない場合、会員情報の保護及び運営の効率性のため、利用を制限することができます。 「会社」は、本条の利用制限の範囲内で制限の条件及び詳細な内容は、利用政策において定めるところによります。 本条に基づき、「サービス」の利用を制限したり、契約を解約する場合は、「会社」は第9条[「会員」への通知]に基づき通知します。 「会員」は、本条による利用制限等について、「会社」が定めた手続きに従い、異議申し立てをすることができます。 この時、異議が正当であると「会社」が認めた場合、「会社」は直ちに「サービス」の利用を再開します。

**第 21 条（責任制限）**

「会社」は、天災地変またはこれに準ずる不可抗力により「サービス」を提供できない場合は、「サービス」の提供に関する責任が免除されます。 「会社」は、「会員」の帰責事由による「サービス」利用の障害については、責任を負いません。 「会社」は、「会員」が「サービス」に関して掲載した情報、資料、事実の信頼度、正確性等の内容に関しては、責任を負いません。 「会社」は、「会員」間又は「会員」と第三者間において「サービス」を媒介として取引等を行った場合は、責任が免除されます。 「会社」は、無料で提供されているサービス利用に関して、関連法に特別な規定がない限り、責任を負いません。

**第 22 条(準拠法及び裁判管轄)**

「会社」と「会員」の間で提起された訴訟は、大韓民国法を準拠法とします。 "会社"と"会員"の間に発生した紛争に関する訴訟は、提訴当時の"会員"の住所により、住所がない場合は居所を管轄する地方裁判所の専属管轄とします。 ただし、提訴当時に「会員」の住所または居所が明確でない場合、管轄裁判所は民事訴訟法に基づいて定めます。

**第 24 条(利用契約の成立等)**

「利用者」は「会社」が提供する次の事項またはこれと類似した手続きにより、利用申請を行います。 「会社」は契約締結前に、各号の事項に関して「利用者」が正確に理解し、ミス又は誤りなく取引できるように情報を提供します。 「コンテンツ」又は「サービス」リストの閲覧及び選択 電子メールアドレス等の入力約款内容、契約の申込みの撤回が不可能な「コンテンツ」や「サービス」について、「会社」が取った措置に関する内容の確認が約款に同意し、上記第3号の事項を確認したり拒否する表示(例、マウスクリック) 「コンテンツ」又は「サービス」の利用申請に関する確認または「会社」の確認に対する同意決済方法の選択 「会社」の利用者、「利用者」は「利用者」については「利用者」 実名ではなかったり、他人の名義を利用した場合、虚偽の情報を記載したり、「会社」が提示する内容を記載しなかった場合

**第 25 条(未成年者利用契約に関するトゥクチク)**

"会社"は万20歳未満の未成年の利用者が有料サービスを利用しようとする場合に両親など法定代理人の同意を得たり、契約締結してから追認を得なければ未成年者本人または法定代理人がその契約を取り消すことができるという内容を契約締結前に告知する措置をとります。

**第 26 条(受信確認通知·利用申請の変更およびキャンセル)**

mangoSTEEMSは、"利用者"の利用申請があった場合、"利用者"に受信確認通知をします。 受信確認通知を受けた「利用者」は、意思表示の不一致等がある場合、受信確認通知を受けた後、直ちに利用申請の変更及び取消を要請することができ、「会社」はサービス提供前に「利用者」の要請がある場合、遅滞なくその要請に従って処理しなければなりません。

**第 27 条(mangoSTEEMSの義務)**

「会社」は法令と本約款が定める権利の行使と義務の履行を信義に従い誠実に行わなければなりません。 「会社」は、「利用者」が「コンテンツ」及び「サービス」の利用及びその代金内訳を随時確認できるよう措置します。 「会社」が「コンテンツ」及び「サービス」の利用に関して「利用者」から提起された意見や不満が正当であると認めた場合、これを遅滞なく処理します。 利用者が申し立てた意見や不満事項については、掲示板を活用したり、メール等によりその処理過程および結果をお伝えします。 「会社」は、本約款における義務違反により「利用者」が被った損害を賠償します。

**第 28 条("利用者"の義務)**

「利用者」は、次の行為をしてはならない。 申請または変更時、虚偽内容の記載他人の情報利用「会社」に掲示された情報の変更「会社」が禁止した情報(コンピュータプログラム等)の送信または掲示 「会社」とその他第三者の著作権等の知的財産権に対する侵害 「会社」及びその他第三者の名誉を損傷させ、または業務を妨害する行為わいせつまたは暴力的な言葉や文章、画像、音響、その他公序良俗に反する情報を 「会社」のサイトに公開または掲示する行為その他の行為、「会社」のホームページにおいて、または掲示することしてはいけません。

**第 29 条（支払方法）**

「コンテンツ」及び「サービス」の利用に対する代金支払い方法は、次の各号のうち可能な方法で行うことができます。 ただし、「会社」は「利用者」の支払方法について、いかなる名目の手数料も追加して徴収しません。 テレホンバンキング、インターネットバンキング、メールバンキング等の各種口座振替プリペイドカード、デビットカード、クレジットカード等の各種カード決済マイレージ等mangoSTEEMSが支給したポイントによる決済mangoSTEEMSと契約を結んだか、mangoSTEEMSが認めた商品券による決済電話又は携帯電話を利用した決済その他電子的支給方法による代金支払い等

**第 30 条(有料コンテンツおよび有料サービスの提供と中断)**

有料コンテンツおよび有料サービスは、年中無休、1日24時間提供することを原則とします。 「会社」は、コンピュータ等の情報通信設備の保守点検、交換及び故障、通信途絶又は運営上の理由がある場合、有料コンテンツ、又は有料サービスの提供を一時的に中断できます。 この場合、「会社」は、第9条[「会員」に対する通知]に定める方法により、「利用者」に通知します。 ただし、「会社」が事前に通知することができないやむを得ない事由がある場合、事後に通知することができます。 「会社」は、相当の理由なく有料コンテンツ、または有料サービスの提供が一時的に中断されたことにより、「利用者」が被った損害について賠償します。 ただし、「会社」が故意又は過失がないことを立証する場合、この限りではありません。 「会社」は、有料コンテンツ、または有料サービスの提供に必要な場合は、定期点検を行うことができ、定期点検時間は、サービス提供画面にお知らせしたところに従います。 事業種目の転換、事業の放棄、業者間の統合等の理由により有料コンテンツ又は有料サービスの提供ができなくなる場合、「会社」は第9条[「会員」に対する通知]に定める方法により「利用者」に通知し、当初「会社」が提示した条件に基づき、「利用者」に補償します。 ただし、「会社」が補償基準等を告知しなかったり、告知した補償基準が適切でない場合は、「利用者」のマイレージ又は積立金等を現物または現金で「利用者」に支払います。

**第 31 条(有料コンテンツ及び有料サービスの変更)**

"会社"は相当な理由がある場合に運営上、技術上の必要に応じて提供しているコンテンツとサービスを変更することができます "会社"は有料コンテンツ及び有料サービスの内容、利用方法、利用時間を変更する場合に変更の事由、変更されるコンテンツサービスの内容及び提供した日付などをその変更前7日以上、該当コンテンツの初期画面に掲示します。 第2項の場合に変更された内容が重大か、"利用者"に不利な場合には"会社"が該当有料コンテンツ及び有料サービスの提供を受けている"利用者"に第9条〔"会員"に対する通知]に定めた方法で通知して同意を受けます。この時、"会社"は同意を断った"利用者"については変更前のコンテンツまたはサービスを提供します。ただし、そのようなコンテンツまたはサービス提供が不可能な場合有料サービス提供契約を解約することができます。 "会社"は有料コンテンツまたは有料サービスに対する第1項による有料コンテンツ及び有料サービスの変更についた第3項による契約の解約により"利用者"が被った損害を賠償します。

**第 32 条（情報の提供及び広告の掲載）**

「会社」は、「利用者」がコンテンツやサービスの利用中に必要と認められる様々な情報をお知らせやメール等の方法により、「会員」に対して提供することができます。 ただし、「会員」は、いつでも電子メール等を通じて受信をお断りすることができます。 第1項の情報を電話及び模写送信機により送信しようとする場合は、「会員」の事前同意を得て送信します。 「会社」は、「コンテンツ」サービスの提供に関連し、コンテンツまたはサービス画面、ホームページ、電子メール等に広告を掲載できます。 広告が掲載されたメール等を受信した「会員」は、受信拒否を「会社」にすることができます。

**第 33 条(掲示物の削除)**

「会社」は、掲示板に情報通信網利用促進及び情報保護等に関する法律に違反した青少年有害媒体物が掲示されている場合、これを遅滞なく削除します。 ただし、19歳以上の"利用者"のみ利用できる掲示板は例外となります。 「会社」が運営する掲示板等に掲示された情報により法律上利益が侵害された者は、「会社」に当該情報の削除または反論の内容の掲載を要請することができます。 この場合、「会社」は遅滞なく必要な措置を取り、これを直ちに申請人に通知します。

**第 34 条(著作権等の帰属)**

「会社」が作成した著作物、特に「会社」が提供する「コンテンツ」と「サービス」に関する著作権、その他の知的財産権は「会社」に帰属します。 「会社」が提供するサービスのうち、提携契約により提供される著作物に関する著作権、その他の知的財産権は当該提供業者に帰属します。 「利用者」は、「会社」が提供するサービスを利用することで得た情報や著作物のうち「会社」または提供業者に知的財産権が帰属した情報や著作物を「会社」または提供業者の事前の承諾なく、複製、転送、出版、配布、放送その他の方法により営利目的で利用したり、第三者に利用させてはなりません。 「利用者」は、「会社」が提供する有料·無料コンテンツを「利用者」と「会社」との利用契約の目的に合致する範囲内でのみ利用できます。 「会社」は約定に基づき、「利用者」の著作物を使用する場合、当該「利用者」の許可を得ます。

**第 35 条(個人情報保護)**

「会社」は「情報通信網法」等の関係法令の定めるところにより、「利用者」の個人情報を保護することに努めます。 個人情報の保護及び使用については、関連法及び"会社"の個人情報取扱方針が適用されます。

**第 36 条の1(契約の申込みの撤回)**

「会社」の有料コンテンツ及び有料サービスは、契約の申込みの撤回が可能な商品と契約の申込みの撤回が制限される商品に区分されて提供され、このような内容は「利用者」が有料コンテンツ及び有料サービスを購入する際に取引画面に告知されます。「会社」と契約の申込みの撤回が可能な有料コンテンツ及び有料サービスの利用に関する契約を締結した「利用者」は、購入日又は有料コンテンツ及び有料サービスの利用可能日から7日以内には契約の申込みの撤回ができます。 「利用者」は、次の各号のいずれかに該当する場合、会社の意思に反して第1項の規定による契約の申込みの撤回等をすることができません。 ただし、会社が第3項の規定による措置を取らない場合は、第2号から第5号までの規定に該当する場合にも、契約の申込みの撤回等をすることができます。 「利用者」に責任のある事由により財貨などが滅失し、又は毀損された場合、「利用者」が財貨を使用または一部消費した場合、時間が経って再び販売することが困難な場合、複製可能な財貨などの包装を毀損した場合、用役または「文化産業振興基本法」第2条第5号のデジタルコンテンツの提供が開始された場合(ただし、可分的用役または可分的デジタルコンテンツで構成された契約の場合は、提供が開始されていない部分については、この限りでない) 知り得る場所に明確に明記したり、試験使用商品を提供するなどの方法により、契約の申込みの撤回などの権利行使が妨げられないよう措置しなければなりません。 ただし、第2項第5号中デジタルコンテンツに対して"利用者"が契約の申込みの撤回等ができない場合には契約の申込みの撤回等が不可能であるという事実の表示と共に大統領令で定めるところにより試験使用商品を提供する等の方法により契約の申込みの撤回等の権利行使が妨害されないようにしなければなりません。 もし「会社」がこのような措置を取らない場合、第2項第2号ないし第5号の契約の申込みの撤回制限事由にもかかわらず、「利用者」は契約の申込みの撤回をすることができます。 「利用者」は第1項ないし第3項の規定にかかわらず、有料コンテンツ及び有料サービスの内容が表示·広告内容と異なるか、契約内容と異なる場合には、購入日または有料コンテンツ、有料サービス利用可能日から3ヶ月以内、その事実を知った日から30日以内に契約の申込みの撤回をすることができます。 「利用者」は口頭、または書面(電子文書を含む)、電子メールにより契約の申込みの撤回をすることができます。 **第 36 条の2("会社"の責による有料コンテンツ利用契約の契約取り消し) "利用者"は、次の各号の事由があるときは、当該"コンテンツ"を供給された日から3月以内またはその事実をない日または知った日から30日以内にコンテンツ利用契約を解除・解約することができます。 利用契約で約定した"コンテンツ"が提供されない場合、提供される"コンテンツ"が表示・広告などと相違したり、顕著な差がある場合、その他の"コンテンツ"の欠陥で正常な利用が著しく不可能な場合"利用者"は靴または書面(電子文書を含む)、電子郵便で契約取り消しを行うことができます。 "会社"は第3項によって、"利用者"が表示した申し込みの撤回又は契約解除・解約の意思表示を受信した後、遅滞なくこのような事実を"利用者"に返信します。 "利用者"は第2項の事由で契約解除・解約の意思表示をする前に相当な期間を定めて完全な"コンテンツ"あるいはサービス利用の瑕疵に対する治癒を要求することができます。**


**第 37 条（"利用者"の申込みの撤回と契約解除·解約の効果）**


「会社」は「利用者」が契約の申込みの撤回の意思表示をした日から、または「利用者」に契約解除·解約の意思表示について返信した日から3営業日以内に代金の決済と同じ方法によりこれを還付しなければならず、同一の方法により払い戻しが不可能な場合には、これを事前に告知しなければなりません。 この場合、「会社」が「利用者」に還付を遅延したときは、その遅延期間について公正取引委員会が定め、告示する遅延利子率を乗じて算定した遅延利子を支払います。 「会社」が第1項に基づいて還付する場合、「利用者」が有料コンテンツ及び有料サービスの利用から得た利益に該当する金額を差し引いて還付することができます。 「会社」は、上記の代金を還付するにあたり、「利用者」がクレジットカード, 電子マネー等の決済手段により財貨等の代金を支払った時は、遅滞なく決済手段を提供した事業者に財貨等の代金の請求を停止又は取り消すよう要請します。 ただし、第2項の金額控除が必要な場合、この限りではないことができます。 「会社」、「コンテンツ等の代金を受け取った者」又は「利用者とコンテンツ利用契約を締結した者」が同一人でない場合、各自は契約の申込みの撤回又は契約解除·解約による代金の払い戻しに関する義務の履行において連帯して責任を負います。 「会社」は「利用者」に、本約款と関連法令において許容する契約の申込みの撤回を理由に、違約金又は損害賠償を請求しません。 しかし、"利用者"の契約解除·解約される損害賠償の請求に影響を及ぼしません。

**第 38 条(過誤金)**

「会社」は、過誤金が発生した場合、利用代金の決済と同じ方法により過誤金全額を払い戻さなければなりません。 ただし、同一の方法で払い戻しができない場合は、その旨を事前に告知します。 「会社」の責任のある理由により過誤金が発生した場合、「会社」は契約費用、手数料等に関係なく過誤金全額を返金します。 ただし、「利用者」の責任ある理由により過誤金が発生した場合、「会社」が過誤金を払い戻すのにかかる費用は、合理的な範囲内で「利用者」が負担するものとします。 「会社」は、「利用者」が主張する過誤金に対し払い戻しを拒否した場合、正当に利用代金が課されたことを立証する責任を負います。 「会社」は、過誤金の払い戻し手続きをデジタルコンテンツ利用者保護指針に従って処理します。

**第 39 条(コンテンツ瑕疵等による利用者被害補償)**

「会社」は、コンテンツ瑕疵等による利用者被害補償の基準·範囲·方法及び手続きに関する事項をデジタルコンテンツ利用者保護指針に従って処理します。

**第 40 条(免責条項)**

「会社」は、天災地変、またはこれに準ずる不可抗力により「コンテンツ」と「サービス」を提供できない場合は、「コンテンツ」と「サービス」の提供に関する責任が免除されます。 「会社」は、「利用者」の帰責事由による「コンテンツ」と「サービス」の利用における障害については、責任を負いません。 「会社」は、「会員」が「コンテンツ」に関して掲載した情報、資料、事実の信頼度、正確性等の内容に関して、責任を負いません。 「会社」は、「利用者」相互間又は「利用者」と第三者間において「コンテンツ」と「サービス」を媒介にして発生した紛争等について、責任を負いません。

**第 41 条(紛争の解決)**

「会社」は紛争が発生した場合、「利用者」が提起する正当な意見や不満を反映し、適切かつ迅速な措置をとります。 ただし、迅速な処理が困難な場合、「会社」は「利用者」にその事由と処理日程を通知します。

**第 42 条(準拠法及び管轄裁判所)**

「会社」と「利用者」の間で提起された訴訟は大韓民国法を準拠法とします。 「会社」と「利用者」の間に発生した紛争に関する訴訟は、提訴当時の"利用者"の住所により、住所がない場合は居所を管轄する地方裁判所の専属管轄とします。 ただし、提訴当時に「利用者」の住所または居所が明確でなかった場合の管轄裁判所は、民事訴訟法に基づいて定めます。 海外に住所や居所を持つ"利用者"の場合、"会社"と"利用者"の間に発生した紛争に関する訴訟は前項にもかかわらず、大韓民国ソウル中央地方裁判所が管轄裁判所となります。

**第 43 条(その他の条項)**

会員様は、相手方の書面による事前の同意なくして本約款上の権利と義務を第三者に譲渡できません。 本約款と関連し、当事者間の合意により追加作成された契約書、協定書、通報書等と会社の政策変更、法令の制定·改正又は公共機関の告示·指針等により会社がサービスを通じて会員に公示する内容も本約款の一部を構成します。

本約款は2019年1月1日から適用されます。株式会社mangoSTEEMS

`;
