const content = `
유료서비스 이용약관
2019.6.27. 제정

1. 목적 및 적용의 범위 등
1.1. 본 약관은 ‘서비스’ 내에서 판매되는 ‘포인트’의 판매(구매)이용환불 등과 관련하여 ‘회사’와 ‘회원’ 간의 권리관계를 명확히 하는 것을 그 목적으로 합니다.
1.2. 본 약관은 ‘포인트’를 구매하는 ‘회원’에게 적용됩니다.
1.3. 본 약관은 ‘이용약관’에 대한 부수적 약관으로, 본 약관에서 정하지 않은 부분은 ‘이용약관’에서 정한 바에 따릅니다.

2. 용어의 정의
2.1. ‘이용약관’에서 정의된 용어는 본 약관에서도 동일한 의미를 갖습니다.
2.2. 본 약관에서 추가적으로 정의하는 용어는 다음과 같습니다.
① ‘포인트’이란 ‘서비스’ 내에서 ‘유료상품’을 구매할 수 있는 전자적인 지급수단을 의미합니다.
② ‘유료상품’이란 ‘회원’이 ‘서비스’에서 유료로 구매할 수 있는 각종 상품(WizClass 유료 강의)을 의미합니다.

3. 포인트의 내용 및 이용기간 등
3.1. ‘회사’는 ‘회원’이 ‘포인트’의 구입 전에 ‘포인트’의 거래(구입)조건을 정확하게 이해하고 실수나 착오 없이 거래할 수 있도록 다음 각 호의 사항들을 적절한 방법으로 본 약관 및 ‘서비스’ 내에서 고지합니다. 아래 제2호의 설명 페이지 내용을 포함하여 각 호의 내용은 약관의 일부로서 ‘회사’와 ‘회원’을 구속합니다.
① 판매자의 상호, 대표자의 성명·주소 및 전화번호 등
② ‘포인트’의 종류 및 가격, 이용방법, 이용시기, 이용조건 등 구체적 내용
[포인트 소개]
포인트이란 유료 상품 구매 시 사용하는 WizClass의 자체 화폐 단위입니다.
PC / Android / iOS 플랫폼 별로 충전할 수 있으며, 충전한 포인트로 WizClass의 유료 상품을 구매할 수 있습니다.
위즈스쿨 포인트는 위즈스쿨 내 WizClass 내에서 이용할 수 있습니다.
[포인트 가격]
포인트는 대략적으로 1원에 1개의 가치를 기준으로 하고 있습니다.
포인트의 구매 단위는 위즈스쿨에서 제공되는 단위로만 구매가 가능하며, 이후 결제와 관련된 고객 문의 역시 처음에 구매한 단위 기준으로 이루어집니다.
※ 참고해주세요!
1. 구매한 포인트는 마이페이지에서 확인할 수 있습니다.
2. 포인트 가격은 부가세(VAT)가 포함된 가격입니다.
③ 청약철회 및 계약해제의 기한·행사방법 및 효과, 환불 등에 관한 사항
④ 소비자의 피해보상, 불만 처리 및 분쟁 처리에 관한 사항
3.2. ‘포인트’의 이용기간은 충전일 혹은 마지막 이용일로부터 5년으로, 해당 기간 내 사용되지 않은 ‘포인트’는 상사시효에 근거하여 자동으로 소멸됩니다. 다만, 다른 법령에서 이보다 단기의 시효의 규정이 있는 때에는 그 규정에 의합니다.

4. 포인트 이용계약의 성립
‘포인트’의 이용계약은 ‘회원’이 본 약관에 동의하고, ‘회사’가 정하는 결제수단과 방법을 통해 ‘포인트’을 구매(충전)함으로써 성립됩니다.

5. 포인트의 구매(충전) 및 환불
5.1. ‘포인트’의 충전은 위즈스쿨 홈페이지를 통한 결제, 신용카드, 카카오페이, 계좌이체 등 회사에서 서비스 플랫폼 별로 제공 가능한 결제방식을 통해서 이루어집니다. 단, ‘회원’이 선택한 결제수단을 운영하는 사업자가 별도로 있는 경우, ‘회원’은 해당 결제수단을 이용하기 전에 해당 결제수단의 사업자가 요구하는 절차를 이행하여야 해당 결제수단을 이용하여 결제를 진행할 수 있습니다.
5.2. ‘회사’는 다음의 각 호의 경우에는 ‘회원’의 구매(충전) 신청을 승낙하지 않거나 승낙을 유보하거나, 추후 승낙을 취소함으로서, 포인트 이용계약의 성립을 거부하거나 취소할 수 있습니다.
① 실명이 아니거나 타인의 명의를 이용한 경우
② 동일IP의 대량 결제, 유사 ID에서의 연속적인 결제, 도용이력 등을 고려하여 지정된 위험 IP에서의 결제 등 도용에 의한 충전으로 판단되는 경우
③ 구매 과정에서 허위의 정보를 기재하거나, 필수사항을 기재하지 않은 경우
④ 만 19세 미만의 미성년자가 법정대리인의 동의 없이 신청한 경우
⑤ 결제에 대한 지급이 실제로 이루어지지 않았거나 않을 가능성이 있는 경우
⑥ (‘유료상품’을 포함하여) ‘컨텐츠’에 대한 저작권 침해 등 ‘이용약관’을 위반한 ‘회원’인 경우
⑦ ‘이용약관’ 제7조에 따라 이용제한을 받은 ‘회원’인 경우
⑧ 위 ① 내지 ⑦을 위반한 사실이 있는 ‘회원’인 경우
⑨ 기타 이용 신청을 승인하는 것이 관계 법령이 위반되거나 사회 안녕 질서 및 미풍양속, 회사의 관련 약관 등에 위반되는 경우
5.3. ‘회사’는 다음의 각 호의 경우에는 각 호의 사유가 해소될 때까지 승인을 유보할 수 있습니다.
① ‘서비스’에 장애가 발생한 경우
② ‘서비스’의 정상적인 운영을 위한 설비 혹은 관련 인력이 부족한 경우
5.4. ‘회사’는 ‘회원’이 정상적으로 ‘포인트’을 충전하여 ‘포인트’ 이용계약이 체결된 경우, 3.1.항 각 호의 내용을 포함하여 계약체결의 내용을 즉시 ‘회원’에게 교부한다.

6. 유료상품의 내용 및 변경/폐지 등
6.1. ‘회사’는 ‘회원’이 ‘유료상품’의 구입 전에 ‘유료상품’의 거래(구입)조건을 정확하게 이해하고 실수나 착오 없이 거래할 수 있도록 다음 각 호의 사항들을 적절한 방법으로 본 약관 및 ‘서비스’ 내에서 고지합니다. 아래 제2호의 설명 페이지 내용을 포함하여 각 호의 내용은 약관의 일부로서 ‘회사’와 ‘회원’을 구속합니다.
① 판매자의 상호, 대표자의 성명·주소 및 전화번호 등
② ‘유료상품’의 종류 및 가격, 이용방법, 이용시기, 이용조건 등 구체적 내용
[유료상품 소개]
유료상품이란 위즈스쿨에서 제공하는 WizClass 온라인 유료 영상강의 콘텐츠를 의미합니다.
WizClass 온라인 강의를 구매하기 위한 수단으로 포인트 충전이 필요하며, 포인트 충전은 각종 결제수단을 이용한 구매, 위즈스쿨에서 제공하는 비정기적 이벤트에 의한 지급 등의 방법으로 가능합니다.
③ 청약철회 및 계약해제의 기한·행사방법 및 효과, 환불 등에 관한 사항
④ 소비자의 피해보상, 불만 처리 및 분쟁 처리에 관한 사항
6.2. ‘회사’는 ‘회원’에게 사전에 공지하고 ‘유료상품’의 종류와 가격 등 그 구체적인 내용을 변경하거나 특정한 ‘유료상품’을 폐지할 수 있습니다. 단, 그와 같은 변경 및 폐지가 ‘회원’에게 불리하거나 ‘회원’의 권리와 의무에 중대한 영향을 미치는 경우에는 ‘이용약관’ 제2조에 따른 공지 및 통지의 절차를 거쳐 변경합니다.
6.3. ‘회사’가 전 항에 따라 ‘유료상품’의 종류 및 내용 등을 변경 혹은 폐지함에 따라 ‘회원’이 자신의 귀책 없이 기존에 구매한 ‘유료상품’을 구매할 당시에 정한 조건 등에 따라 이용하지 못하게 될 경우, ‘회사’는 그와 같이 이용하지 못한 부분에 대해서 ‘회원’에게 적절한 보상을 합니다.

7. 유료상품 이용계약의 성립
7.1. ‘유료상품’의 이용계약은 ‘회원’이 본 약관에 동의하고, ‘포인트’ 이용계약을 통해 구입한 ‘포인트’을 이용하여 ‘유료상품’을 구매함으로써 성립됩니다.
7.2. ‘회원’의 ‘유료상품’ 이용계약 신청에 대한 거부, 승낙의 유보 및 취소에 대해서는 5.2.항과 5.3.항을 준용합니다.
7.3. ‘회사’는 ‘회원’이 정상적으로 ‘포인트’을 이용하여 ‘유료상품’을 구매하여 ‘유료상품’ 이용계약이 체결된 경우, 3.1.항 각 호의 내용을 포함하여 계약체결의 내용을 즉시 ‘회원’에게 교부합니다.

8. 청약철회등
8.1. ‘회원’은 「전자상거래등에서의 소비자 보호에 관한 법률」(이하 ‘전자상거래법’)에 따라 유상으로 구매한 상품에 대하여 계약체결에 대한 내용을 교부 받은 시점 혹은 상품을 공급 받은 시점으로부터 7일 이내에 청약의 철회 및 계약의 해제(이하 ‘청약철회등’)를 할 수 있습니다. 다만, ‘회원’이 구매한 상품을 이미 사용한 경우에는 사용한 부분에 대해서는 ‘청약철회등’이 불가능하며, 이러한 불가능 사유에 대해서는 상품 구입 시 ‘회사’가 ‘회원’에게 명확하게 고지합니다.
8.2. 위 8.1.항에도 불구하고 상품의 내용이 표시·광고의 내용과 다르거나 계약내용과 다르게 이행된 경우에는 ‘회원’은 그 상품을 공급받은 날부터 3개월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 ‘청약철회등’을 할 수 있습니다.
8.3. 위 8.1.항 혹은 8.2.항에 따라서 ‘회원’이 ‘청약철회등’을 한 경우, ‘전자상거래법’에 따라 ‘회원’이 구매한 상품은 반환되며, ‘회사’는 ‘전자상거래법’에 따라 환급 절차를 진행합니다.
8.4. 기타 본 조에 따른 ‘청약철회등’에 대한 사항은 ‘전자상거래법’에 따라 규율 및 처리됩니다.

9. 청약철회등 이외의 환급 및 환불 등
9.1. ‘회원’은 사용하지 않은 ‘포인트’에 대해서 환불 요청을 할 수 있으며, ‘회사’는 ‘회원’의 환불 요청에 대해서 관련 법령을 준수하여 환불을 진행합니다. 다만, 이러한 환불 요청은 유상으로 구매한 ‘포인트’에 대해서만 가능하며, 보너스 혹은 프로모션 등으로 무상으로 지급 받은 ‘포인트’은 환불의 대상이 아닙니다.

10. 계약의 해지 등
10.1. ‘회원’과 ‘회사’는 상대방이 ‘포인트’ 및 ‘유료상품’ 이용계약에 따라 약정한 의무를 상당한 기간 이내에도 이행하지 않을 경우, 해당 계약을 해지할 수 있습니다.
10.2. ‘회사’는 ‘회원’이 5.2.항의 ① 내지 ⑦(영구적 이용제한 행위로 한정한다)의 행위를 한 것을 확인한 경우, 해당 ‘회원’과의 ‘포인트’ 및 ‘유료상품’ 이용계약을 즉시 해지할 수 있습니다.

11. 책임의 제한
11.1. ‘회사’는 천재지변 또는 이에 준하는 불가항력으로 인하여 구매된 ‘유료상품’을 약정한대로 제공할 수 없는 경우에는 그에 대한 책임이 면제됩니다.
11.2. ‘회사’는 ‘회원’의 귀책사유로 인해 구매된 ‘유료상품’을 약정한대로 제공할 수 없는 경우에는 그에 대하여 ‘회사’의 고의 또는 중과실이 없는 한 책임이 면제됩니다
11.3. ‘회사’는 ‘회원’ 상호간 또는 ‘회원’과 제3자 간에 ‘유료상품’을 매개로 하여 발생한 분쟁 등에 대하여는 책임을 지지 않습니다.

12. 양도금지
‘회원’은 본 약관에 따라 발생한 계약상 지위 및 권리의무를 타인에게 양도하거나, 질권의 목적으로 삼는 등 일체의 처분행위를 할 수 없습니다.

13. 기타 소비자 피해보상 및 불만처리 등
13.1. ‘회사’의 고의 또는 과실로 인해 ‘회원’이 구매한 ‘유료상품’을 정상적으로 이용할 수 없는 등 ‘회원’에게 피해가 발생할 경우, ‘회사’는 그에 대한 해결을 위해서 최선의 노력을 하며 그와 더불어 해당 피해에 대한 적절한 보상을 합니다.
`;
export default content;
