const content = `
‘주식회사 위즈스쿨’(이하 ‘회사)은 정보통신망 이용촉진 및 정보보호 등에 관한 법률(이하 ‘정보통신망법’) 제27조의 2에 의거 이용자의 개인정보보호와 권익을 보호하고 관련된 고충 및 애로사항을 신속하게 처리하기 위해 아래의 개인정보처리방침을 제정·운영하고 있습니다.
회사는 관계법령에서 규정하고 있는 책임과 의무를 준수하고 실천하기 위해 최선의 노력을 하고 있습니다

1. 개인정보 수집이용 및 보유기간 안내
회사는 서비스제공을 위하여 필요한 최소한의 개인정보를 수집하고 있습니다. 
회사는 서비스에 따라 수집목적, 항목, 보유 및 이용기간, 수집방법을 달리하며 아래와 같습니다.  

(1) 회원가입 및 고객관리
수집 목적 : 회원가입 및 고객관리, 만 14세 미만 아동의 법정대리인 동의 및 동의여부 확인, 자체서비스 회원가입
필수 수집항목 : 이름, 비밀번호, 이메일 주소, 휴대폰 번호, 법정대리인 정보(법정대리인의 이메일 주소, 법정대리인의 팩스번호)
보유 및 이용기간 : 회원탈퇴 시

(2) 서비스 이용
수집 목적 : 신용카드 결제, 카카오페이 결제, 동영상 코딩 강의 컨텐츠 제공, 앱 공유/플레이 플랫폼 운영, 교재 등 학습과정에 필요한 물품 배송, 프로필 설정
필수 수집항목 : 카드사, 카드번호, 이름, 비밀번호, 이메일 주소, 휴대폰 번호, 주소, 생년월일, 프로필 이미지, 닉네임, 학교
보유 및 이용기간 : 회원탈퇴 시

(3) 고객문의
수집 목적 : 문의 및 불만사항 응대
필수 수집항목 : 이름, 비밀번호, 이메일 주소, 휴대폰 번호, 기타 입력한 사항, 문의내용, 법정대리인 정보(법정대리인의 이메일 주소, 법정대리인의 팩스번호)
보유 및 이용기간 : 회원탈퇴 시

(4) 광고성 정보 발송(선택)
수집 목적 : 상품안내, 신규 패키지, 체험 이벤트 참여 등의 마케팅 활용
선택 수집항목 : 학생이름, 학년, 휴대폰 번호
보유 및 이용기간 : 동의철회 시

(5) 기타
회사는 처리하는 개인정보의 목적과 항목이 변경될 경우에는 관련법령에 따라 사전에 동의를 요청합니다.
회사는 주민등록번호 처리를 원칙적으로 금지하며 업무 수행 중 법률, 대통령령, 국회규칙, 대법원규칙, 헌법재판소규칙, 중앙선거관리위원회 규칙 및 감사원규칙에서 구체적으로 주민등록번호의 처리를 요구할 경우에만 처리하고 있습니다.
회사는 하기의 방식으로 개인정보를 수집합니다. 
- 홈페이지, 모바일 앱 등에서 이용자가 개인정보를 직접 입력하는 방식
- 박람회, 세미나, 행사진행 등 오프라인에서 서면으로 개인정보를 수집하는 방식
- 서비스를 이용하는 과정에 쿠키, 접속로그 등 자동으로 생성 및 수집되는 방식

2. 개인정보자동수집 장치의 설치와 운영거부에 관한 사항
회사는 서비스 이용과정에서 이용자로부터 다음과 같은 정보들을 자동으로 생성/수집하고 다음의 목적으로 이용할 수 있습니다.
개인정보 자동수집안내 및 거부방법
(1) 수집항목
방문기록, 접속IP정보, 서비스 이용기록. 광고 식별자, 쿠키(쿠키는 웹사이트를 운영하는데 이용되는 서버(http)가 이용자의 컴퓨터 브라우저에게 보내는 소량의 정보이며 이용자 PC 컴퓨터의 하드디스크에 저장되기도 합니다.)

(2) 쿠키의 설치·운영 및 거부 방법
아래 방법을 통해 쿠키 저장을 거부할 수 있습니다.
- Internet Explorer : 웹 브라우저 상단의 도구>인터넷 옵션>개인정보 메뉴의 옵션 설정
- Microsoft Edge : 웹 브라우저 상단 메뉴 > 설정 > 고급 설정 보기 > 쿠키 메뉴의 옵션 설정
- Chrome : 웹 브라우저 상단 메뉴 > 설정 > 고급 > 콘텐츠 설정 > 쿠키 메뉴의 옵션 설정

개인정보 자동수집정보 사용목적
(1) 관련법규의 준수
회사는 관련법규의 준수를 위해 이용자의 접속기록(로그인)기록을 보관할 의무가 있습니다.
(2) Session방식의 회원인증
회원인증을 위해 암호화된 Session ID만 서버에 저장하는 방식으로 개인정보가 노출되지 않습니다. 또한 일정시간이 지나면 Session 정보가 자동으로 사라지며, 이용자가 Session정보를 삭제하고 싶으신 경우 로그아웃을 하거나 브라우저를 닫으면 바로 삭제가 됩니다.
(3) 서비스 품질 향상 및 신상품 개발
이용자의 사용이력, 구매 및 검색 이력 등 이용자의 관심, 성향 등을 파악하고 분석하여 기존상품의 품질을 개선하여 더 나은 서비스를 제공하고 신상품을 개발하는데 사용합니다.
(4) 잠재고객 대상 상품 광고 및 마케팅
기존고객과 유사한 관심을 가질 것으로 예상되는 잠재고객, 최근 서비스Web/App 방문자 등에게 상품을 노출합니다.


3. 개인정보의 보유·이용기간 및 파기
회사는 개인정보 수집 시에 동의 받은 개인정보 보유·이용기간 내 또는 관련법령에 따른 개인정보 보유·이용기간 내 처리하고 해당 목적 달성 및 보유·이용기간이 경과할 시에는 지체 없이 해당 개인정보를 복구 또는 재생할 수 없는 방법으로 파기합니다. 
(1) 회원정보
이용자가 회원을 탈퇴할 경우 회사는 지체 없이 보유하고 있는 개인정보를 삭제합니다.
1년간 서비스를 이용하지 않을 경우 회사는 개인정보를 별도로 분리하여 보관합니다. 
[안내사항] 
A. 기간 만료 30일 전까지 개인정보가 파기되거나 분리되어 저장·관리되는 사실
B. 기간 만료일
C. 해당 개인정보의 항목
D. 안내방법 : 전자우편·서면·전화 또는 이와 유사한 방법 중 어느 하나의 방법

※ 관련 법령에 따른 의무 보유기간
(표 들어올 것)

4. 개인정보 처리 위탁
회사는 원활한 개인정보 업무처리를 위하여 일부 개인정보처리업무를 위탁하고 있으며 위탁 계약 체결 시 관련법령에 따라 수탁자가 개인정보를 안전하게 처리하는지를 감독하고 있습니다. 위탁업무의 내용이나 수탁자가 추가, 변경될 경우에는 지체 없이 관련 법령에 따른 사전 동의 안내 또는 본 개인정보 처리방침을 통하여 공개하도록 하겠습니다.

개인정보처리 위탁업무 및 수탁사 안내
(표 들어올 것)


5. 개인정보의 제3자 제공
회사는 이용자의 개인정보를 ‘제1조 개인정보 수집이용 및 보유기간 안내’에서 명시한 범위 내에서만 처리하며, 이용자의 별도 사전동의, 관련법령의 특별한 요구가 발생하는 경우에만 개인정보를 제3자에게 제공합니다. 
(1) 관련법령에 근거한 사전동의 없는 제3자 제공안내
통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우로서 특정 개인을 식별할 수 없는 형태로 제공하는 경우
관계법령에 의하여 국가기관으로부터 요구 받은 경우
범죄에 대한 수사상의 목적이 있거나, 정보통신 윤리위원회의 요청이 있는 경우
기타 관계법령에서 정한 절차에 따른 요청이 있는 경우


6. 개인정보의 안전성 확보조치
회사는 이용자의 개인정보를 안전하게 관리하여 개인정보가 분실, 도난, 유출, 변조 또는 훼손되지 않도록 최선을 다하고 있으며 필요한 기술적, 관리적 및 물리적 조치를 하고 있습니다. 
(1) 개인정보 취급 직원의 최소화 및 교육 
개인정보를 취급하는 직원을 최소화하고, 주기적인 개인정보 보호 교육을 실시하여 개인정보를 관리하는 대책을 시행하고 있습니다.

(2) 내부관리계획의 수립 및 시행 
개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.

(3) 접속기록의 보관 및 위·변조 방지
개인정보 침해사고 발생 시 대응이 용이하도록 개인정보처리시스템에 접속한 기록(웹 로그, 요약정보 등)을 최소 1년 이상 보관, 관리하고 있으며, 접속 기록이 위·변조 및 도난, 분실되지 않도록 보안기능을 사용하고 있습니다.

(4) 개인정보의 암호화
이용자의 개인정보는 암호화되어 저장 및 관리되고 있습니다.

(5) 해킹 등에 대비한 기술적 대책 
회사는 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적인 갱신·점검을 합니다. 또한 외부로부터 접근이 통제된 구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단하고 있습니다.

(6) 개인정보에 대한 접근통제 제한
개인정보를 처리하는 개인정보처리시스템에 대한 접근권한의 부여, 변경, 말소를 통하여 개인정보에 대한 접근통제를 위한 조치를 하고 있습니다.


7. 이용자 및 법정대리인의 권리와 그 행사 방법
이용자 및 법정대리인은 등록되어 있는 이용자의 개인정보와 관련하여 언제든지 열람, 수정, 정정, 삭제, 동의철회를 하실 수 있습니다. 
(1) 이용자의 권리 및 행사방법
열람/수정 : 홈페이지 > 설정 > 계정 확인 메뉴에서 회원정보 열람/수정이 가능합니다.
회원 탈퇴 : 홈페이지 > 설정 > 회원 탈퇴에서 가능합니다. 
그 밖에 서면, 전자우편 등을 통하여 개인정보의 처리 정지 및 삭제를 요구할 수 있습니다.
회사는 개인정보의 오류 등에 대한 정정 또는 삭제를 요청한 경우에는 정정 또는 삭제를 완료하기 전까지 당해 개인정보를 이용하거나 제공하지 않습니다.
개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 당해 개인정보의 삭제를 요구할 수 없습니다.
회사는 이용자 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인인지를 확인합니다. 

8. 개인정보보호 책임자 및 이용자 권익침해에 대한 구제방법
회사는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 이용자의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보보호책임자를 지정하고 있습니다. 
(표 들어올 것)

(1) 개인정보보호 책임자의 역할
이용자는 서비스를 이용하면서 발생한 모든 개인정보보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보보호 책임자에게 문의하실 수 있습니다. 회사는 이용자의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.

(2) 권익침해관련 도움 받을 수 있는 기관 
이용자의 권익침해 관련 자세한 도움이 필요하시면 아래 기관에 문의하여 주시기 바랍니다.
- 개인정보 침해신고센터 (한국인터넷진흥원 운영)
소관업무 : 개인정보 침해사실 신고, 상담 신청
홈페이지 : privacy.kisa.or.kr	
전화 : (국번없이) 118		
주소 : (58324) 전남 나주시 진흥길 9(빛가람동 301-2) 3층 개인정보침해신고센터
- 개인정보 분쟁조정위원회	
소관업무 : 개인정보 분쟁조정신청, 집단분쟁조정 (민사적 해결)
홈페이지 : www.kopico.go.kr	
전화 : (국번없이) 1833-6972	
주소 : (03171) 서울특별시 종로구 세종대로 209 정부서울청사 4층
- 대검찰청 사이버수사과
소관업무 : 사이버범죄사건에 대한 수사지휘 담당
홈페이지 : www.spo.go.kr
전화 : (국번없이) 1301
주소 : 서울특별시 서초구 반포대로 157
- 경찰청 사이버안전국
소관업무 : 사이버범죄사건에 대한 수사진행
홈페이지 : police.go.kr/www/security/cyber.jsp
전화 : (국번없이) 182
주소 : 서울특별시 서대문구 통일로 97


9. 개인정보처리방침 변경에 관한 사항
개인정보처리방침은 시행일로부터 적용되며, 관련법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 7일 이전에 홈페이지의 공지사항을 통하여 고지할 것입니다 

개인정보처리방침 시행일 : 2020년 03월 16일
2019년 01월 01일	최초제정	
2020년 03월 16일	1차개정
`;

// const content = `
// 위즈스쿨 개인정보처리방침
// (2018.12.31 현재)

// 주식회사 위스스쿨의 개인정보처리방침을 알려드립니다.
// 주식회사 위즈스쿨(이하 ‘위즈스쿨’ 또는 회사’)는 서비스 기획부터 종료까지 정보통신망 이용촉진 및 정보보호 등에 관한 법률(이하 ‘정보통신망법’), 개인정보보호법 등 국내의 개인정보 보호 법령을 철저히 준수합니다.

// 제1조 (개인정보의 수집 항목 및 수집 방법)
// 회사는 이름, 이메일, 휴대전화번호, 주소, 생년월일, 성별, 본인 인증 정보, 법정대리인의 개인정보(회원이 만 14세 미만자인 경우에 한함), 서비스 이용 내역, 결제수단에 관한 정보, 기타 이용자가 임의로 제공한 정보, 재화 또는 서비스 이용과 관련하여 신용카드 관련 정보, 은행계좌 관련 정보 등 유료 결제에 이용된 정보를 수집·이용합니다. IP주소, 기기정보, 서비스 이용기록, 방문 기록, 불량 이용 기록 등이 자동으로 생성·저장될 수 있습니다. 개인정보는 이용자 본인이 직접 제공하는 경우 외에 어플리케이션, 홈페이지, 고객센터·전화·이메일을 통한 온라인 상담, 제휴사 기타 제3자 등을 통해 수집됩니다.

// 제2조 (개인정보의 수집 및 이용목적)
// 회사는 수집한 개인정보를 회원 가입·유지·탈퇴 의사 확인, 본인 여부 확인, 계약의 체결·유지·이행·관리·개선, 신청 서비스의 제공, 연구, 교육, 법령상 의무 이행, 법령 및 약관 위반 여부에 관한 조사, 약관 개정 등 공지사항의 전달, 설문조사, 민원처리, 분쟁해결, 맞춤형 서비스 제공, 연구, 인구통계학적 분석, 물건 등의 배달, 유료서비스를 이용한 경우 결제의 승인·변경·취소 등 결제 업무 수행 등의 목적으로 이용합니다.

// 제3조 (개인정보의 보유 및 이용기간)
// 회사는 회원이 회사의 서비스를 이용하는 기간 또는 전 조에서 정한 목적 달성을 위하여 필요한 기간 동안만 보유하며, 법령이 정한 바에 따라 개인정보를 파기 또는 별도 보관합니다.

// 회사는 회원의 탈퇴에도 불구하고 관련 법령에서 의무보유기간에 대해 별도로 정한 경우에는 해당 기간 종료 시까지 개인정보를 보유합니다. 계약 또는 계약철회 등에 관한 기록: 5년(전자상거래 등에서의 소비자보호에 관한 법률) 대금결제, 재화 등의 공급에 관한 기록: 5년(전자상거래 등에서의 소비자보호에 관한 법률) 소비자의 불만 또는 분쟁처리에 관한 기록: 3년(전자상거래 등에서의 소비자보호에 관한 법률) 전자금융 거래에 관한 기록: 5년(전자금융거래법) 로그인 기록: 3개월(통신비밀보호법)

// 제4조 (개인정보의 제3자 제공)
// 회사는 정보주체의 동의가 있거나 법률에서 정한 요건과 절차를 갖춘 경우에 한하여 개인정보를 제3자에게 제공합니다.

// 제5조 (개인정보의 위탁)
// 회사는 서비스 제공을 위하여 필요한 업무 중 일부를 외부 업체에 위탁하고 있으며, 위탁받은 업체가 정보통신망법, 개인정보 보호법 등에 따라 개인정보를 안전하게 취급하도록 필요한 사항을 규정하고 관리/감독을 하고 있습니다.

// 제6조 (회원의 권리·의무 및 행사방법)
// 회원 및 법정대리인(회원이 만 14세 미만 아동인 경우)은 법령에 저촉되지 아니하는 범위 내에서 자신 또는 만 14세 미만 아동의 개인정보에 대한 열람, 정정, 삭제, 처리정지를 요청할 수 있습니다. 회사는 법령이 정한 바에 따라 본인확인 기타 사실확인을 위한 정보 또는 자료의 제공을 요청할 수 있습니다.
// 회원 및 법정대리인의 개인정보 조회, 수정은 회사의 개인정보 관리책임자에게 서면, 전화, 전자우편, 모사전송(FAX) 등을 통하여 할 수 있으며, 회사는 이에 대해 지체 없이 조치를 취합니다.
// 회원이 개인정보에 대한 정정을 요청한 경우에는 정정이 완료되기 전까지 회사는 당해 개인정보를 이용하거나 제3자에게 제공하지 않습니다.

// 제7조 (개인정보의 자동수집방치 설치·운영)
// 회사는, 회원이 어플리케이션, 홈페이지에 접속할 때 생성되는 정보를 담은 임시 파일인 쿠키(Cookie)를 수집하지 않습니다.

// 제8조 (개인정보의 파기 등)
// 회사는 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 해당 개인정보를 복구·재생할 수 없도록 지체 없이 파기합니다.
// 전항에도 불구하고 이용자로부터 계속 보관·이용에 관한 별도 동의를 받거나 관련 법령에 따라 개인정보를 계속 보유하여야 하는 경우에는, 해당 개인정보를 해당 목적 범위 내에서 안전하게 보관·이용합니다.
// 개인정보 파기의 절차 및 방법은 다음과 같습니다.
// 파기절차

// - 회사는 파기 사유가 발생한 개인정보를 선정하고, 회사의 개인정보 관리책임자의 승인을 받아 개인정보를 파기합니다.

//   파기방법

// - 회사는 정보가 저장 된 유형에 따라
// (1) 완전파괴(소각·파쇄 등)
// (2) 전용 소자장비를 이용하여 삭제
// (3) 데이터가 복원되지 않도록 초기화 또는 덮어쓰기 수행 등의 방법으로 파기합니다.

// 제9조 (개인정보의 안전성 확보조치)
// 회사는 개인정보의 안전하고 적법한 처리를 위하여 다음과 같은 조치를 취하고 있습니다.
// 관리적 조치 : 내부관리계획 수립•시행, 정기적 직원 교육 등
// 기술적 조치 : 개인정보처리시스템 등의 접근 권한 관리, 접근통제시스템 설치, 고유식별정보 등의 암호화, 보안프로그램 설치
// 물리적 조치 : 전산실, 자료보관실 등의 접근통제

// 제10조 (개인정보 관리책임자 등)
// 위즈스쿨은 이용자의 개인정보 관련 문의사항 및 불만 처리 등을 위하여 아래와 같이 개인정보 보호책임자 및 담당자를 지정하고 있습니다.
// 이 름 : 이광용
// 소 속 : 운영팀
// 직 위 : CPO
// 전 화 : 010-3053-9545
// 메 일 : wizlab@wizschool.io

// 회원은 회사의 서비스(또는 사업)를 이용하면서 발생한 모든 개인정보 보호 관련 문의, 불만, 피해구제 등에 관한 사항을 개인정보 관리책임자 및 담당부서로 문의할 수 있습니다. 회사는 회원의 문의에 대해 지체 없이 답변 및 처리할 것입니다.

// 제11조 (권익침해 구제방법)
// 회원은 개인정보 침해, 오남용 등에 대한 신고나 상담이 필요한 경우 아래의 기관에 문의할 수 있습니다.

// [개인정보 침해신고센터]
// 홈페이지 : privacy.kisa.or.kr
// 전화 : (국번없이) 118
// 이메일 : privacy@kisa.or.kr
// 주소 : (05717) 서울시 송파구 중대로 135 (가락동 78) IT벤처타워 한국인터넷진흥원 개인정보침해신고센터
// 대검찰청 사이버범죄수사단 : 02-3480-3573 (www.spo.go.kr)
// 경찰청 사이버안전국 : (경찰청 대표)182 (www.netan.go.kr)

// 제12조 (개인정보 취급방침의 효력발생 및 변경)
// 본 개인정보 취급방침은 2019. 1. 1. 부터 적용됩니다. 본 개인정보 취급방침을 변경할 때에는, 회사는 홈페이지 또는 앱의 ‘공지사항’ 등을 통해 그 내용을 회원에게 고지합니다.
// `;
export default content;
